{"pos": ["Dont speak it but its fire", "Oh I’m up up .. this song get me so lit 🔥... if y’all be in your bed and dont want to get up just play this song it hypes you up!", "KeeP watching", "i don't now what she is saying but i like 😍😍😍😍 Egypt ❤", "I don't know what the heck they're saying, I just know that it's sexy af😂", "Love you Bad Bunny!", "I love  Blackpink 😘", "My blood , sweat and tears\nI miss BTS", "One hand In the air for XXXTENTACION for open us this mixes Spanish with American", "I love this song ❤❤❤ ", "his voice so sweet", "Army fam thanks again for streaming...I watch over 30 times but am going to start streaming till morning cause I know some of you need to sleep or get on with reality. Thx so much and lots of love to u all!!❤️💯👌🏽✋🏼", "Curiously waiting for song", "Luis fonsi I love you for what you do to help 💖 I have a problem 2 im sick I go to high school 💙 and im 18 years old I love your music", "Don't you just love it when  the view keep raising everytime you refresh the video", "On loop! Let’s go BLINKS! Road to 1BILLION!!! <3", "I love it!!", "this is the best song ever i can't believe it's being a year Black swan queen from BTS kings  (crying)", "I have 10M in my wallet, can I give that for them?", "Is it just me that 0:13 is my fav part?", "I love rose hair on the first chorus", "Dont tell me this man did kill it insane", "No SAMAS shall prosper against this song", "They made it an army, I am so happy", "nice song man Love from Greece", "y love music", "Who needs swag when you have gangnam style", "good", "Congrariulations! This music ultrapassed 1B views!", "LONG LIVE POP SMOKE !!!", "im american BUT THIS SONG IS JUST AWESOME!!", "who gets goosebumps when you sing this? or is it just me?", "This is the bop. Can’t wait for the music video for this song.", "jimin in this mv makes me genuinely happy", "I love this song", "Whole album is fire can actually sit and listen to the whole thing widd out having to skip a song miss you pop 🤧🔥‼️💫", "Effed up the way she was dropped by her label; she was definitely one of the break out artists on the scene. Still love her to this day.", "Awsome like always", "I LOVED Jin part, and charli's voice was amazing too.", "what a throwback i luved this song", "he waass good at the Diversitoys tour! good warm up act <3", "I keep Make it right <3", "i love this song; the guy looks like ashley cole ", "QUEEN OF SLAYING MY ENTIRE EXISTENCE", "I know Red Velvet have 2 concepts the red concept and the velvet concept what's that concept red or Velvet? Because this is my FAV!❤️", "This a bop.", "i have no idea what he is saying.... but i am in love with his voice... and one thing for sure, spanish is one of the most beautiful languages i have ever heard ....❤", "World Cup Song 2018: Shakira\nWorld Cup Song 2022: Shakira\nWorld Cup Song 2026: Shakira\nWorld Cup song Forever...: Shakira\nCan we please just have this schedule for World Cup Song artist. Please :) ", "@HardcoreHDGamer  pitbull is cuban too man, it's all about representing Latin ppl and cubans. this is not about sending a message to all Latinos around the world. GO LATINAMERICA , GO PARAGUAY, GO ARGENTINA ,GO URUGUAY, GO BRAZIL bring the cup home baby.", "this my favorite song", "So in love with this song. I can listen to it all day.", "Oh my! Their voices are Paradise for us Armys . 😇", "I grew uppp listening tooo this songggggg", "you rock", "i like it", "Love this song", "just wow, never been that moved by a song before..", "Indonesia army here, always suport bts 😍", "TWICE's legendary song\n\n\nperiodt.", "KOSOVA  GIRL,  KOSOVA   SONG IS  THE  BESTT   :D   HIHIIH", "Halo maluma is the best song ever\nSalam dari indonesia🇮🇩", "Damnn I want my ex back now 😔 no cap", "well..that's way better than madonas;)", "I like the rhyme of the song", "ay love", "The lip singing game is strong", "His songs are always the best 😍😍😍😭", "i'm polish and i love this song. i'm fan of ed and bocelli", "Killing it as usual!", "Everything that chris brown do is dope !!!!!!", "Black Pink in the top", "THIS COLLAB IS AMAZING OMG YAS!!", "Fan is sakira", "Anyone else watching the whole day?? Or is it just me?!", "Twice make me feel special", "this song is great", "Love this song!!!😍", "BTS are awesome I already listen this song's uptown 70 times", "Sheeesh this one hits 👼 R.I.P THE WOO", "The way Ed says Barcelona will be a new anthem for FC Barcelona fans out there!!\n#SuperbEd", "Mahmood You must make a tour around the world!\n\nP.S: There is nothing like the Eurovision Song Contest to discover such high-quality songs and super interesting Artists.", "selena looks so cute and so happy kkk OMG I'm in love with this video <3", "pure black <3", "Really enjoying this track so chill! sounds a bit like they have sampled Lykke Li too :)", "My favotite song of Ed Sheeran <3", "I love this! 🔥", "I support this", "just i can understand by subtitle but it is so ramantic ^_^ i like it ", "Lucas is seriously killing me😍", "He fine .", "Yes Queen Janet! Love this video, love the song. Melanin popping in every shade from dark chocolate, to a milky lattė all having a shot a centre stage. Daddy yankee good collab!!", "The Nostalgia is real", "Beautiful", "Fun video!! :D \n-Much love from Scotland. ", "Even though I dnt understand the lyrics but I still love it... Stoner for life mfkers", "I love this song!!! Nd the novela was great!!!!!! ", "I would love to see them perform all the songs in BE.", "top song of 2017", "A very beautiful song thank you for all this hard work.       From Morocco 🇲🇦😘", "My best frnd and i used to sing this along and now we are not best friends anymore. I came back here cause i miss her.", "Usher & Romeo!!! OMG!!! LUV IT!!", "I still dance to this!+!", "Don't know what he's saying but it sounds lit...", "I love you celine and love your songs", "Really nice song.", "we all just need more Shakira", "One of Andrea Torres favorite song", "I wish I understood Spanish this sounds awesome", "i love it !!", "This will make 1b views this year!", "luv this song i dont knoe why. it have nic rythem ", "This song is currently No.1 in 19 countries on iTunes! GAGAPINK IS THE REVOLUTION!", "Tyga riding almost the same beat every time,but still good", "100 times better than Despacito", "Hegel will be proud of this music video.", "this is the best duo😭😍😍😍", "Music sounds great, guys", "I want to know the meaning of the latin lyrics of this song in English.", "i get it i watch this and dna 100 times a day be cuz i love them both and i am giveing the viws", "Please go back to this genre again. You'll bloom again.", "@sammydu928 i dont think so. give me everything and rain over me are beautiful to", "4 million likes 4 years later. I remember vibin to this song when it came out lmao. Also guys how's quarantine doing?", "FINALLYYYYY I WAS STREAMING IT ON V-LIVE BUT FINALLY I CAN NOW STREAM IT ON YT", "Love Drake's voice when he is actually singing not rapping :)  SIN TU AMOR YO SOY NADA cheesy love words just sound better in Spanish ", "Shakira is beautiful and very intelligent. She masters 7 languages perfectly.Spanish, English, Portuguese French ,Italian , Arabic and Catalan.", "I really like their songs, I love Blackpink.", "Could someone tell me the lyrics 🤷. It sounds like a really good song", "i nearly died of laughing in the beginning but this songs pretty chill.", "This song is a forking masterpiece", "I  hate justin bieber but love this song", "thank u pit for giving us a song like that :D\n", "i like", "I don't understand the words but the music is beautiful. Great job!", "So pure, classy and beautiful! Portugal 2018💘😊", "OHMYGODDDD!!!!! Just imagining Dua Lipa with mah girlzz Black Pink makes me wanna cryyy!!!!! I wanna see an official music video ASAP!!!", "This go hard💎", "Puerto Rican’s are everywhere! small ass island, big ass talent 🇵🇷🇵🇷🇵🇷", "Kanye you the man", "Bad and boujee 2.0", "all i mean, described as i like, how do u feel  what i feel thanks for all u do.... kiss too much", "I'm in love with this song,the visuals, people, dancing,the outfits I just love it", "Love it so much!", "Unpopular Opinion: this song is the most meaningful song on this album.This song makes me cry everytime idk why it feels just so relatable even though i haven't been in a relationship(boyfriend)..Hits so hard especially the record of his ex in the end.", "The music video makes me to like it more even it's sad💔 btw guess I'm the only american watching this😂❤", "This makes me want sour candy (>.^)/* \nGaga + BlackPink is AMAZIIINNGG", "I'm  inlove with the three of them... this collab is 🔥🔥🔥🔥🔥🔥🔥", "love the song and the girls", "I like the song and the performer, so congratulations from the UK!!", "Every time I watch this video I cry.. I love the magic of this video", "My two fave artists, this is dream come true🥰", "That’s my favorite songs", "J balvin best of the best", "The song is very relaxable", "I don' t get why people hate this song and think waka waka was the best, then I have to say Copa de la vida was much better than Shakira's song. Is it Pitbull or the country (Brazil) people hate?", "Love this song!!!!!!:)", "cheap video but awesome music :p", "I CAN'T LIVE WITH OUT THIS SONG!!!", "So glad I found you guys. Even thanks is not enough to express my gratitude but still I want to thank you. Hearbeat is a masterpiece indeed.", "guys out of pure curiosity i looked up a translator and it said that jamais vu means never seen in french🤔🤷🏻‍♀️ a sister doesn’t know how to feel...", "i love this is song", "Who disliked this song. I will flip out", "Yessss Empress Of deserves so much more attention 🔥", "This song actually make me wanna repent for all my sins", "love bts", "to be honest, im glad snoop did this. I don't want to dis on his whole snoop lion thing but I will always prefer snoop dog.", "Love ozuna real fan gonna like this", "This music so addictive, love this song", "love this men to death", "Best way to learn Spanish", "God I love this song and video ughh", "Smoothing voice 🎶 man", "I can't understand the languages but it touches heart. Nice.", "If iron maiden had covered this subject , there’d been lots of angry mums . These fellas put fun into metal big time - the lot I grew up with had nothing on these chaps . Wunderbar (?)", "I love you BTS Arab Army", "Norway, you are the real winners!! Best song by far.", "Nice I love this song...", "This is my new ringtone🇮🇳", "Is this Spain or Russia song i like this song very much", "i love them all but i think this song suit jin and v.  my bias is jungkook but i cant deny that jin an v's voice are making me melting 😍😄 . i love bts!!! the rapper line is also amazing 😍😝", "new fave song rn", "omg!! I forgot about this guy! I love him! XD", "I love you guys you make me believe in myself once again. I need one day to meet you; I need to see you at least once in my life. I know that I am going to do it even if it is last thing that I do in my existence.", "Rappers that look like they came straight from the 80 and 90's lol. Track is fire though.", "By far one of my fave songs from his album 🔥🔥🔥🔥🔥", "I love this song. And this is funny video.", "still good in 2017", "I love the songs", "this song really be making me feel like a bad b", "I have my freaking exam and I can't focus because of u Jimin 🤗\nHelp me stop it u r slaying it😭😭😭", "This is seriously my favorite song like forreal xD\nI CAN'T STOP LISTENING TO IT", "I loved that music 😍❤❤", "I used to not like this song. I understand now.", "This is my song 💜💜💜 SPOT ON!! I'm done with these times🦋", "Is there a movie for this song? Please reply, really helps! Makes my day better ...", "Dj khaled did it again 💯", "He know Usher will make this song better than any artis.love Usher.", "To the 67K dislikes: Daechwita Daechwita play it loud Daechwita he's the king he's the boss!", "kings of kpop, wbk", "skrillex the best wtf 6 milion views kmon people", "I can't understand a word but I love this song", "This song made my day", "And that’s just now I find this song ?? I wanna cry", "He's the prince. He's amazing. The song is amazing. Really I mean wooow just is amazing... I don't have words...", "U rock this song", "I don’t know what he’s saying but this song is so good", "i lake this song so much", "Bad ass\n", "man I love this but dont know the meaning of the lyrics", "My Favorite Song", "My very favorite one. I really love the sami parts of it. I dont know what the jury was doing, but this should have been the first place.", "This song make my stomach dance🤧", "i can't understand any thing 😂😂😂😂💔\nbut it's awesome \nhello from egypt we want to see you here", "I want to stand and waltz the night away. Such brilliance, magic and romance", "I love it so much, please continue like this, it's excellent!!😍😍😍😍😍", "get it J-HOPE!", "Blackpink is the revolution!!!!!!!!!!!!!!!!!!!!!!!!!", "Congratulations for this collaboration with Lauv!!! So good. 💜💜💜", "What a great use of Izotope VocalSynth at the end of the track , sooooo good , bad bunny es el mejor !!", "absolutely, high music high flow", "I love this girl. ", "love it really catchy!!! =) thumbs up if u agree! love u j.lo!!! xxx", "love this song!!!! only problem? the obvious BMW product placement at the beginning. honestly, does BMW think that more people are gonna buy there cars if its in a music video. Another example is on American idol, the judges are all obviously drinking from a Coke cup. :) Anyway, LOVE THIS SONG!!! especially the chorus.", "Such a beautiful song that I don't like because it's the last thing I heard at the beach before I decided to swim and ended up breaking my neck and paralyzed for life.😔😔", "This is fucking hilarious to watch but love the enthusiasm even I didn't understand not a single word", "I was listening to this on repeat during my run and it just kept on going and I kept on going and I overdid it and ended up fainting from fatigue 😅 I LOVE THIS REMIX 💁🏻‍♀️😭😍", "I cannot believe that next month this Masterpiece will turn a year old. Time actually flies really fast.", "@xxxAshleighxxxx hahaa, the words are amazing you should look for a translation of the lyrics :)", "It's bighit", "y'all saying \"real madrid/barça fans this and that\" when the song is about the city and not the football teams lmao i'm from barcelona and i love real madrid what does one thing have to do with the other. ANYWAYS THE SONG IS AMAZING", "3x times better than Netherlands", "I love this song.🤫", "This song has that punch that only BEP is able to pull out. Can’t stop playing this song. Bravo!!!", "I’m not Spanish but this song is my favourite I love it so much", "With this comeback BLACKPINK will be the REVOLUTION.", "Mixing great voice with latin flavor 💓 super cool beats 🔥", "I never got so happy and exited watching a video!!! I got to admit i had to get used to bad bunny being different than before but i was smiling and dancing through the whole video!!! I love him", "Wish i could understand?", "Literally the best song in the world so amazing well done hrvy I love you❤❤❤", "They know exactly how to keep us entertained in this quarantine.............\nHats off to u guys 👍", "OMG! I JUST CANT STOP DANCING TO THIS SONG NOW! DEEEEYM", "wow jimin  saranghe and  I love  voice", "It's such a pretty language 😁 Dutch girl here\nLike if you're Dutch", "1:42-1:49  i am still so in love with ten's part", "how to stop listening!!! what kind of sorcery is this???", "This is the best song ever 😂😂😂", "Dam this song came out Official drakeu my mens def for this dint even no u speak spanish bruh dam u a beast for this 1 drake nice 1", "I don't know why but I'm addicted to this song xD", "ARMY: Where is my angel?\nBTS: I´m here, please used me.\n\nily this song, so much.", "This is the best music", "I love it so badly", "Love this song so much\n", "I wanted so much that one direction came back", "Perhaps the only good part of middle school, if not the best part of it", "Two legends \nIncredible song", "Ohhh this guy is awesome 💜", "On is the best title track and that's on period Luv", "verry good", "Still rep the ends Ed boi! Remember that tune from years ago with you  and Slix? Tune! Hackney/Bethnal misses you boiiii", "Listening to this full volume playing watchdogs legion \nEpic", "i love it\n", "My name is Syesha and osuna good song love it so much I’m Spanish", "I really like this song", "perfect!", "Filter is my favorite song and jimin is my favorite", "I was looking for something cool and i found this", "Is there anything, any style Ed Sheeran can't do?", "I really like every song they do 😍", "Dj put it on repeat cos is hot", "im lost with the lyrics omg the lyroc itself is tooo goodd damn i stan aesthetic group", "This is a BOP! This is a hit! This is world wide bitch success!! \nAh-MAZING!", "ILOVE IT VERY MUCH", "This is fire 🔥", "So much better than the remix", "Wow!!! Shes got a hit!! Loved it!!  Gave me chills!!! Welcome back Céline!!", "This makes me miss summer :(", "I like this one better than el anillo", "As always another hit from Jonas Brothers.", "y love you", "This is amazing 😉😍", "This song is really good I love it.  All of bad bunny  songs are good.", "Love you mochi forrever\n.love you bts", "I heard this on Spotify BRUH it lit and when it say she want it all omg favorite part", "OI, I AM FROM BANGLADESH , I AM THE BIGGEST FAN OF YOURS SIR. VOCE ME AMOR .STAYING WITH BLESS .", "This joint is catchy and will fill the dance floors. A step above some of the crap thats been coming out...\n", "I see. I like. Ohh me!", "I don't understand wat they are singing but trust me I sing it from the begging to the end am in love with it", "i love you", "Who else is downloading this ?", "I can't understand but I feel thisss", "I can't Stop listing this", "I think maluma is one of the best ever!!!!!", "Love this band", "Ok the vocalists lowkey rapping makes me wEt", "Killin it babe I'm so proud of you", "watch this 20 times again", "Liam rocks!", "I like we are one !!😘😘😘", "awesome", "My journey is only with BTS💜💜💜\nI love them\nAnd I m proud to be an army", "You're pretty pretty girl nice song", "This is so good", "Omg I am crying so much!! BTS is my whole Universe and my whole world. I love them so much. This is such a beautiful MV! It really touched my heart. Thank you BTS for being apart of my life and opening my eyes to this beautiful Universe we share together. Xxxxxxx", "This is the best music that I have listen.", "Love this song..I love listening to it..it always makes me Wana dance..Ur very talented n wish u the best in Ur music career..", "Going through the album on apple play like add to library haha \nThis song way tooooo cuuute!! 🖤", "i love these guys", "Lol so cuteeeeeeeeee", "Aaaaaaaaaaaaaaaaaaaaaaaa I I I I can't say how happy I am..... thank u BTS", "GIRL you Are a QUEEN !!!!!", "The good thing about taking 5 years of Spanish? Being able to understand exactly what he's saying and smiling about it. ", "All of Latinos want she sings in Spanish, her voice is wonderful, i don't understand any word this song 'cause i don't know French. But don't care, i'm enjoying it so much only with the melody. I love this woman.", "love you all and I enjoyed it! <3333", "gorgeoooous! awesooome from 1:04! I like it very much!!! :))))", "I don't speak Spanish, but this song SMACKS!!!!!!!!!!!!!", "Love your music", "Love this song, love you Shakira! <3", "This music is absolutely magical", "I really don't know why I am crying😞😭 I really love you BTS 💜", "We need this song to have radio play! She's a great artist.", "I love this song", "I love this song..!", "English ? I fuckin love this song", "I just can't stop playing this song", "IIIII LOVE  THIS SONG........ OMG  WISH I WAS THERE", "The best Songg ever :)", "Love it", "The artists, the rhythm, the passion...ahh everything about this song is just incredible!", "I love the sense + his voice +music video : best video of bad bunny 🐰 ever", "but the song is so good", "good😘😘😘", "i love this song.......", "Bad Bunny saved my life", "ozuna you are the king of music love from israel please answer", "i love u", "wow", "this really be slappin", "Jimin's voice is emotional \nMost of their songs I like his parts the most because of his voice 😭😍", "this song is the jam", "Life is better with the Jonas Brothers 💕😍💕😍", "andrea bocelli is the grandpapa of singing", "HOLY SH!T! I just found these guys... I did not expect this kind of video.", "Love it", "I love forever JIMIN", "Omggggggggg they are back with another hit sonngggg 👍 if you agreeeee\n\nThanks for the likess❤❤❤", "This is very good 😍Especially Daddy Yankee and Rosalina🥺⁦❤️⁩Am I the only one who likes to scream with excitement?🎶🎶✨", "OMG  I W A S VERY SAD TODAY , THANKS FOR MUSIC. IT HEALS MY HEART. Nice music.))))", "I really like", "Epic song", "Extremely talented bunny teeth boy <3", "This is so catchy!\nMe: i think i have got the earworm from spongebob", "any English speaker in the comments? 😂😂love this but don't get a thing", "*YOU GO GIRLSSS*", "I do not understand French. but I think in this language a song can sound even more beautiful.", "best song ever", "I REMEMBER MY GRANDMA SHOWED ME THIS SONG i was obsessed with this song I still am😔", "Till this day I adore this song", "No matter how long this video is, it’s always gonna be a banger", "Best song ever!!!!!!!", "Holly crap i thinl I am in love 😍", "how to play this song without crying", "that was really perfect, that's what I call art💕\ngood luck💜\nlove u💗", "I dnt understand actually language ..but i love to listen enrique voice 😭😭😍😍", "Plz do more music av a xxx\nI love you alla I'm big fan", "Good job maluam you make peoples happy because  you make lost of nies songs", "cool", "This is fire! 🔥", "I like this song", "just one word: BEAUTIFUL", "I love you", "I love you OZUNA (BANGLADESH)", "Idk what he’s saying but I love it & I love him", "The best 💗", "Dope ass video and song", "Buenos bad bunny!!! Really awesome, and yeah keep it up!! Egerly waiting for more...😎😎😎😎", "Hope is not a gay song. Cuz I been bumping it. Lol.", "Handling his cuteness is a real struggle for me 😍😍😍 I love you mikaaa", "this one hits hard", "LOVE FROM INDIA ! BTS...ENTHUSIASTIC", "I love blackpink", "Love music amooo", "bravo !!!", "I love this Christmas song it’s the best one!", "This song it’s literally genius", "Blackpink I Love You", "i despise kpop but why is it so catchy i was only here bc of the ggx sample", "Woah! I dont understand spanish but it gives me goosebumps!🤘🙌 hit like this if u agree!👍", "Deserves more views!!!", "i love this song ...muah", "This song is good even though I don't understand.", "Drake surprised me haha this is super good!", "I love this song so much. It reminds me of the man I'm in love with. 💞💕", "i dance to this song..so much ", "TWICE MAKE ME FEEL SPECIAL", "Good vibes", "Jimin you are soooo good", "*why am I crying? why am I crying?? wHyThEFlIpiMCryINg?!?!!?!*", "Don't understand a word but loved every part of it", "Such a enlightening and compassionate song", "Yeah song of all time", "I love you! And I love the clique |-/", "I doesn't understand understand a single word ,but still I used to sing this song frequently ❤️", "BTS is really too much !! I loved, good job!!  ^^ 💕", "What a song", "I love this ..... First time hearing this live in US i guess that's why..lol", "I respect him hardcore for this. Exito! #loveall #lgbtq #respeto", "Who doesn't understand what he saying but still like it?", "What a great use of Izotope VocalSynth at the end of the track , sooooo good , bad bunny es el mejor !!", "Oh my king you are morethen a legend,no one can replace you in this universe,love you 💖💖💗💗😘😘👍", "Jisoo HOW YOU LIKE THAT? \nAAAAAAAAA I LOVE U", "I ran out of patience with @YouTube demonitizing everything. I have since learned about @LBRYio which is a great alternative , it pays you to use it daily and if you become a content creator you can make some Big Bucks! Come check it out here https://lbry.tv/$/invite/@CryptoHustler101:6 $lbc #lbry", "It's in english because it's the universal language and not all the people understands portuguese, I actually liked and I'm Mexican.\nBut whatever, haters gonna hate.", "brought here by a wish to hear every recorded note blake mills has played", "Heart my mate from Kik & I we pissin love this song", "I don't understand a single word in this song, but im a huge fan of Ozuna. Love from South Africa.", "DRAKE = G.O.A.T like if you agree", "Holy Cow it sounds Like an anime Song! I love it!🤘🤘🤘🤘", "I like it", "jennifer she is the best love you\n", "Looooovee it", "Love this", "Her voice and beat is just fucking craaaaaaaazy in my car strollin down lakeshore!!!!! LOL", "This song always give me the chills 😭😭😭😭😭", "interesting!!!!!", "I think farruko is a best singer in the Portorico...\nI love he's every song and music ❤️ my favorite singer ❤️FARRUKO EL PORTORICO...❤️ From 🇮🇹🇮🇹🇧🇩🇧🇩", "I SO LOVE this song SOOO PASSIONATELY!!!", "Trust me this song will be on the list never get old song :’)", "I love this song what a marvelous introduction for the uncultured opera wise. This song put opera in many who would otherwise have ignored it.", "I like this song", "They are the best", "I fucking love the lyrics of this song.", "My goddess has returned!!! I love you Marina! Your music is life.", "i love this version", "Enrique influenced my whole life.\nEnrique helped me get into and fall in love with music. \nNow music gives me a reason to live. I also make covers now. I was a depressed kid but music for me is the real cure.\nThank you Enrique♥️", "THEY. Is killin songs back to back  now Lovin it", "I swear this song can change the world", "I love this song!", "awesome tune", "Love this song. Then hit the like and Which country are you from???.... Im from bangladesh... Yeah.. Standard party quality song...😍", "Hands down...My favorite song on the album👌💗", "This song is one of the best! Is amazing! \nGreetings from Spain👏👏", "Am in love", "I am in love with jennie voice. And rose i just like all there voices!", "omg i am usually not really into latin music but this is FIRE. this is so addictive!! didn't know anitta but im definitely checking more about her now.", "He's a Genius got a good hook and repited everything over and over again and got a hit, smh, very catchy tho", "I do not speak Spanish I do not even know what the song says however I have the feeling that is the best song that this dude has.", "Is this woman going to sprout wings and fly away OMG!!! I don't understand the word's and a single tear just dropped down my face.  What an Angel!", "Absolutely beautiful ......", "just perfect", "i cant understand anything but i love it", "fab i luv this  song i know 3 languages its polish scotish and SPANISH", "Lovely guys...", "One of my favorite songs of BTS.  Been listening to this masterpiece since release till now and will never get tired of it🥺💜", "Omg when dropped the base i smile big up dj Khaled,big up cardi b spit that shit like a nigga,j lo no words for her. Princess \nFrom italy 🔥🔥🔥🔥🔥🔥🔥", "Beautiful", "*me in the first 10 seconds :I already love this song-*", "I love the mood Dark & Wild of BTS", "who's still listening to this undying masterpiece?", "I love this Musik.. ©®", "Very nice song but i dont like the video, it draws to much attention.", "Really good", "THIS IS THE BEST SONG EVER AHHHHHHHHHH", "Didn’t understand anything but I can’t skip🔥", "I came from tiktok somebody explain to me what the hell is this. The song is catchy tho", "Awesome, BTS😍😙😙", "I'm from Africa Tanzania I like it song good music ozuna 🔥", "Not gonna lie, everyone is extremely so good in this song but Rosé singing this song is a revelation. She’s really suited for this one 😍💕", "Bts is the best", "I love ti my favorite  music", "Broo you are multi talented 🤟", "This is AMAZING !!!", "#haute #haute never been disapointed,love this song 🔥🔥 #teambreezy", "What language is that please \nNice tune", "I kinda wish I was italian after hearing this massive beat", "I Love her style song", "ngl I came here after hearing the remix.\nBoth are fucking amazing 🔥", "Daddy yankee is the king of reggeaton", "This song fire asf idfk what hes saying but its lit :)\nmy fellow English viewers ;)", "After watching it, it make me wanna learn Germany", "Although I’ve always liked this song, it has suddenly hit me how lyrically genius this was, not because wasn’t “ahead of its time”, but because it’s so obvious and strait forward yet people try and dilute the message", "im not even army but this is amazing, min yoongi world domination !", "Sir Big Fan from India 🇮🇳", "like", "I love this song", "I love this song <3", "i love that music\n", "i can sing this song  all day <3", "We love the vocal line...", "What a nice song💜😭", "Honestly... this song makes me feel so emotional.", "Love this song... it's like if I was melting with every chord", "Me no understand 🤯 just enjoying this music and colour and  beautiful people💙💜❤💚💛", "i love u ", "I can’t stop watching this... ITS SOO GOOD🔥", "I love his song but I don't  speak Spanish", "This is my song of 2020. Never listend to a better song. baby metal.is slaying it with that perfect leader voice.", "Always have love her <3", "I kinda like this song even tho I don’t know a single word. It just has party vibes", "I love this song! As much as Romeo's voice!", "i love the Jonas brothers", "Addicted this song despite i don't understand any word 😂", "She is Sub-industry of Rihanna 😂 she cannot sing the song live in concerts or tv programs.İ watched her and suprised because of that.  But İ like this song nevertheless.😂", "The beat gives you thrills if you watch it at night in the dark like I'm doing right now😂😂i like the song...you don't have to know the meaning of it.", "cool", "Love the song but i don't understand any word. In fact that I only understand waladi waladi habibi taal hina cuz I am an Arab LOL", "Finally, *real* music.", "How can u hat these amzing people i think those hates r just jealousy", "Yoo the beginning, the girl fine asf 😍😩🤤", "I admire these guys such much for their beauty, style, talent and music. You deserve all the success BTS, keep delivering.", "This is an awesome song!", "🌼💜🌹wow love love love You Benito. Keep these HITS coming!!!!!", "I like the clip!", "*this such a bop*", "im so in love with this song ❤️", "Tell me that Japanese rap wasn't lit asf", "damn, i was excited that florida finally made another song, especially with pitbull and then i click on the video and... i can't believe it.", "Only your videos make me laugh and cry within the same 3 minutes 🐰🐰", "Ok, so I know Jenni, Lisa and Rosѐ, but what's the 4th's name with the awesome dark red hair/highlights?", "♥️ the song\nLove jisoo \nLove rose\nLove jennie \nLove lisa", "This was the most beautiful song ever.I couldnt stop crying.Happy tears it filled my heart and soul with love", "Genuine love 🔥", "These guys worth thousands likes and millions stream. They litterally the crème de la crème in kpop industry.  They are humble enough to \"keep their feet on the ground\" despite their huge popularity. Stan them for lyfe.", "JLo grillin' + chillin' in her lingerie is GOALS!", "I love this song", "Butiful song shakira", "Love this", "vodoo was besser  than  dis", "*I always love Liam  'cause he is the only one who is trying his best efforts to reunion the 1D*", "This song’s a straight vibe ❤️", "This is probably the best song I have ever herd from other songs and I'm not talking about hrvy's songs", "like your fotos", "I love you so sweet blackpink", "This was so beautiful 💜✨", "I love this song..I've never heard it before. It's good. Go BTS!!!", "Love from #Bangladesh..BD", "Yes Kim Taehyung.. I am sooooo proud of you.. You went off with this.", "what ricky martin is gayyy i am sooooooooooooooo sad he is so hot :(\n", "Voice of an angel", "This is so beautiful", "I love this specific song right here, it’s a song that makes an album good and worth of waiting for it.", "Who else can only speak English but enjoys this song", "Im not crying you are", "ight regardless, you guys cant act like youre not impressed with his ability to outlast expectations and his style diversity. this dude smart", "LOVE IT, the song, the energy, the video, the international vibes", "Their voices can heal nations, especially Taehyung and Jin voices.", "best mv", "This song really get me 🥺", "THE ARE ANSOME", "Super M i love you  too much\nMusic is really really amazing\nDance is perfect\nMv is beautiful", "I don’t understand anything but i love the song", "the more i see the mv the more i fall in love with it", "this song is lit", "is so hot", "Good good", "Songs good", "i think that pitbull had the lyrics perfect for what the world cup stands for and that soccer can bring a world together", "I really\nlove this song", "The best🌟", "No matter how many times i listen to this, I am still surprised by how much I LOVE this bop", "love black pink", "My fave in the album", "😭Aahh my heart, this is so sweet yet beautiful. Ah I'm crying 😭😭😭 This is the tear of happiness 💜💜💜", "Their vocals are breathtaking", "my favorite song like e.e.u.", "awesome!!", "This is a masterpiece . You girl is a queen but on mv. Was on amother level. You are a piece of art a magnificent art font worry you're still loved", "XD I fell out of my chair laughing", "\"It's amost like praying\" this is dope 🙌👏🙏", "*let's not lie* \nyou all didn't like the song at the beginning but then you can't stop listening\n*DON'T LIE*", "love all", "i personally hate malu..but this song is really good", "no room to be falling for you without honesty........\ngreat tune", "they cra cra lol and the girl is toooooooooooooooooooooooooooooooo perfect y not a fat girl", "I like this song?????", "Waaaaaaaw bts always great", "great", "okay bad bunny. This song is a fuckin bop!!", "I mean it IS a funeral song. But *Shrug* I like it :D", "Lisa with long black hair so elegant", "Why I'm so addicted to Spanish songs even though I don't understand a word? :(", "I'm so fucking obsessed with this video. It's so sexy! I've honestly never been turned on by a video 😳 Between Jlo, Ricky, and Wisin, I don't know who's sexier! & Ricky could fool anyone into believing he's straight! ", "FANTASTIC !!! The World is music with You  !!! The World is dance with You !!! ENDLESS BRAVO FOR THE FANTASTIC MOOD !!! ALL WE - All World love You very, very, very much !!! BIG, BIG, BIG THANKS FOR THE FANTASTIC VIDEOS, FOR THE FANTASTIC PERFORMANCES !!! GOD BLESS You !!!", "Obsessed with this, just wanna dance to it", "like", "one of the best pop singers in the world", "You are the best", "I can't stop listening (and watching) this , it's soooooo good", "Swa lee my brother u are doing well love yeah <3", "Love it", "you're the best M.A!! ", "Great job team! Excellent piece.  Perfect song to suit any mood. Doesn't matter if the lyrics match one's station in life, the music and the beat will accommodate any & all circumstances . ❤ this for surd!", "love  yuo", "i reall love bts 💗", "Every time Taehyung starts to sing in the begging my heart melts.😥", "I don't understand a single word of this language yet this song has something that turns me on", "i love this song vibes", "one of my favorite songs right here", "crying.", "Everyone who loves this song..thumbs up<3", "muito bonita. VERY BEAUTIFUL FOR MUSIC PRO HAITI.\n\n RIHANNA is pratty", "In my personal rating this is the winner 2019. This song is a top hit, the performance is fantastic! Love from Russia.", "Love it alot", "This song is lit 🔥", "Such hot and sensual song! 🔥\nLove these two.", "what a song baby", "his voice is so sexy!! \n", "Lmao drake & it's good though ", "Awesome song", "I don't know word in Spanish but this song makes me cry !! Idk 😐 💔", "Great Song\n", "AWESOME LOVE THIS", "Yes Enrique ...I love you ...your voice my happiness ...I love you....love you ...you are the best...only you. ...my best boy...my cute boy ....your are my all...... \nI LOVE YOU \n❤love\n❤\n❤❤❤❤❤you", "like", "Like it", "I really like j hope part 😍", "i love you :X:X:X ", "Lunys music is so cool and so fire", "Love this song!", "This song has so strong emotion. I can't stop listening", "Music is awesome", "i love this song so much nicki looks stunning", "MAKE IT LITTTTT", "what the actual fuuuuuuck. i’m bafjusvjyssjlj bitch this this that kpop shit i like.", "The amount of votes of the audience says a lot. One of the best songs today! Really like it! Thank you, Norway, from Russia, for such a great performance!", "Great song, great artists! Hope for Haiti!!!", "TAEYONG BLACK HAIR IS JUST WOW", "just love this,cant understand though!! makes me wanna be a latino", "Omgg jin and jkk are so cute", "Love this song", "darm - this is a catchy tune - great for the summer - dancing to it already woo hoo", "This is amazing", "wow it is nice", "I love love love Rosè's raw voice it's so fresh", "The MV literally makes all of us cry", "this song is pure magic and the lyrics <3 good luck from Poland", "i love Naya Rivera ...! \"I fell in love with santana\" <3 ", "My god Marina is so gorgeous and that's coming from a guy who almost never says that about anyone!", "im done yg comin up with some creative shit...this was lowkey funny cant lie", "I don't understand a shit he said but the vibe is 🔥 🔥🔥🔥", "This music is my favoriti", "This is one of those moments when I wish that I could speak Spanish! Great song!", "spanish ppl are crazy and i like it ;)", "I like😜", "I've been watching this everyday for 3 months straight. Never got tired of it.", "this video is soo cute 😍", "I love you", "One of the best MV's of BTS", "I just love this song 😃😃", "cool", "i like it", "I love this song", "Despacito is the best but Bailando the father of best.....of ol time....Thanxx EnriqueIglesias", "what a catchy tune. video is pretty good too.", "Bts i love you nomer one thing you 😍😍😍😍😘😘", "wow", "IT'S SO BEAUTIFUL!!!11111!!!!!! I'M CRY. OMG BTS LOVE YOUUUUU", "Love this song my man was signing this to me ", "Sash....my playlist in my early 20’s and 20 years later is far superior to today’s crap. Best tunes ever", "How old is Becky (just wanna know)🤔btw love you Becky ❤️❤️", "Jin voice is beautiful ah❤", "Very nice song", "Four queens with badass charismatic", "i like this song. ", "I like this", "Hunny this was a bop and forever will be. #HappyOneYearSpringDay", "@Bervick \"Nada valgo sin tu amor\" from Juanes too, it rocks really good! ", "This song is too good especially in quarantine", "Although I don't understand a word then too love this song 😘😘", "I miss the old shakira 😔💔💔", "When are u going to make a new song?I want to hear it as fast as possible", "Wow! Just made me tear up..♥  Loved it!! I share the love for PR !", "One of the best songs in 2018", "ajhajha the video it is the best , no sex just funn !! \nlove i <3", "The biggest queens", "I love this song its greatest", "Taehyung singing \"I remember\" ufff that part!", "Taeyong said: *WE ARE THE KING OF KPOP* AND *tHaT's A fAcT*", "I don't understand Spanish but I love this song", "Yg and tyga. Dynamic duo.", "Kupidon Invasion!!\nGood Job Alt-j looking forward to hear entire album!", "This song is beast!!", "Kim jisoo world domination", "so beautiful", "Totally not a pit bull fan, but he's good in this.", "She's beautiful!", "Love this😂💗", "I feel the song is too short!! Damn, I feel like a need more Taki Taki after Selena's part.", "RIP the repeat button ...", "Hobi's rap, Jinnie and kookie's vocals... feels like heaven 💜", "i still love this ♥", "Time to say i love this classic", "this song is so damn catchy", "i like this song \n", "this guy is a genius. i cant understand most of what he says but his music is fire", "Wooooooooow is nice", "You love BTS if you like this. 🖒", "good song, good lyric and good music...", "1:00 I AM DEAD STOP IT I ACTUALLY CAN’T BREATHE THIS IS TOO AMAZING FRICKEN BEAT DROP THEIR VOICES IM IN LOVE WTH", "he is SOOO hot AND HAS A BEAUTIFUL VOICE OMGGG IN LOVE", "I like this song, though i dont understand spanish.", ":3 love usher :) but Romeo wins", "luv luv this song!!! Sooooo...catchy and original!!!", "sooooooooooooooooo sexy mika. you are real genious", "@AndreaECPDT, Thank you so much, the Spanish part is beautiful and so is your translation.", "Nayer is just awesome!!", "LOVE THISSSS SONGG TOO MUCHHHHHHH<3", "The queen", "I love this song", "Everyone's hips are so in sync, it's beautiful.", "Thank you Ed", "I like this song", "Im half Spanish and i dont know what hes saying but this song is fireee🔥🔥🔥🔥", "best song ever", "Best performance at the Decade of Difference Concert.\n", "Wtf I was not prepared for this", "i want the video clip NOW!!!!!!!", "The perfect one!", "Nice flow", "Fantastic!!!!!!!!! Worth the wait..........see you in Fort Worth!!!!", "I luv this song sm omg 😭💛", "wow vare good music", "She is such a beautiful woman, and with a beautiful voice.", "Love this song", "Anyone else reckon she's fit lol", "That’s because I love ITZy, everytime make something really good and different.", "i dont understand,,,how is every song from bmth so good?? like wow?? okay thank you", "canada always has the best artist going and let me tell you mia martina your so so talented and so sexy and beautiful i just really love your voice and your beauty i'm a fan oh yes \"xoxo\"", "Love the song so much", "I love this", "All beautiful!", "black pink and lady gaga. Their voices joined in the song, until they made it a wonderful song", "I love them", "er......why has this got like no views?", "Gaga’s voice is stand out", "the beat is litttttttttttttt", "i miss this :((", "IT takes me back in old times Idk why but they are back... I love them... 😍😍😍😍😍\nJennie back with her rap part", "This is pure", "Nice video", "I ABSOLUTELY ADORE ROMEO SANTOS...", "Jungkook's voice is mesmerising \nJin's voice is angelic \nJimin's voice is breath \nLove them so much #BTS army 😍😘😜❤", "Why are they so breathtakingly beautiful like damn let me BREATHE BITXH", "Presented beautifully with beautiful lyrics. 💜", "I like", "i want listen more songs like this", "LIN WITH HIS CUTENESS OMGGGGG", "Okay its time to wake up the whole neighbourhood with this bop", "Wow is good", "I'm on a song spree where i search \"she's a _____\". So far all the songs are pretty good.", "We need music like this on these days!", "I LOVE YOU PRINCE ROYCE ;-)", "🤘very good 😜", "Omg love this track 😍", "Something is special bout shakira... her special asset is not her boobs nor her but... it's her hips and how she dances...", "I dont understand a word but this is my most favourite song", "I usually don't like blackpink music, but this song and mv is really good", "He won the simplicity, the beautiful, the difference and the music ... fantastic Salvador. Congratulations", "❤ur songs but this is still my all time favorite. Ur so talented, romantico y lo mas bello.💋💋💋😍😍😍", "Jlo looks sexy in everything she wears even at 51...Body goals...", "wtf just 4 days and 2,473,174 viewer waa this song its amazing ...", "OWWWW LISA SO GOODDD", "awesome Marc Anthony, never give up, never give up.  viva puerto rico", "I’m super psycho make you crazy when you turn the lights low sour candy \n\nWho sang this line? Her voice is so clear and her vocal tone is on point.", "My fav part for sure 3:22", "I like the song... I don't understand a word he's saying but it sounds like if I did understand I would still like the song", "What I like about this song is that Jungkook’s verse’s were actually English just like charli", "Not gonna lie but this is good!! It’s been a bit since Ozuna released something good", "finally some good song", "Unofficial fact:- We love BTS, BTS has 7 members, when you turn 7 upside down it will be L,full form of L in ARMYs case is LOVE. 7=L {BTS} \nI LOVE YOU *BTS* MORE AND MORE AND DAY BY DAY💜💜💜💜😭😭😭😭💜💜💜", "For me, this song is one of the best song for travel 💜", "I love that. Song so much\n", "very good", "I don't understand a single thing but I love it", "0:01\n\nI love this song", "Fuck yes", "Namjoon looks so fucking good it’s not fair", "Why not a million yet", "okay but can we just appreciate the person behind this video editing and graphics 😍", "Bruh even though im dont understand this, this is still awsome!", "What is it about human race, that something catastrophic always has to happen before anyone notices something is completely wacked. Props up for the song.", "What a amazing song, keep it up, love u edsheeran 😀😀😀😀", "Love love love the colors!  the culture! everything!", "It's a nice song ..I listen it daily", "Just started getting Into Spanish music and I can honestly say,I have no idea what there saying but i damn sure feel it in my soul.\nThis song is so good,and Shakira is gorgeous in all gold.", "love this song! ed sheeran is literally gonna be around for sooooo long, he's amazing", "This song still gets me lit. Kanye you did that!", "LOVE BLACKPINk^^", "Love this song 💓", "Come on guyz... she's not so bad xD ", "like", "Pitbull has made music with some GREAT artists, he will make it far. This video is great! Pitbull's sound mixed with t-pain's weird voice (sorry :P) really works!", "1:36 to 1:37 is so cute", "dude your voice in Spanish.its so goooood", "i like this song (bubble yum bum)\n", "She rocks that hair colour 😱😱😱😱", "This song is very good and this girl is very hot.", "I love you bta \nLove = bts \nBTS+ army= love", "With jimin cutie face🤣", "This is my favorite. Lloro por ti.", "Idk what the hell he’s saying but im damn sure dancing to this song when it comes on😂", "wow so nice song", "Love you and please come to Slovenia. <3", "Love the song but the coqui made me cry", "I don't understand a word but this song keeps playing in my head. Amazing!! I like those ambient sounds at the end. Best part starts 3:15 , where my heart breaks for her \" peu de nous, un rien de tout\" Good job, Jean-Jacques & Céline! Hope you do many songs together! There is a soul in her french songs.", "you are the winner of eurovision 2019💖...this song is so nice👌", "when u dont speak spanish but love this type of spanish music 😂😍", "I love Lady gaga and Lisa. Wow!!!", "Is so fantastic this song", "I love you", "This song is so bad but she's hot so i guess it is worth the view...", "Maind blowing ...", "This MV made me emotional. The way BTS represented ARMY is very deep and meaningful. That's the sweetest way to show love and appreciation. I don't need to talk about the song because it's already a masterpiece. I'm in LOVE", "Who loves bts more than anything else? ❤", "awesum song!\n", "February 2021 and I am sure that I will never surpass this gem", "Oye.. This song and “Clover Cage - On My Mind” are the two songs keeping me sane through these tough times. I just want to send love to everyone and I want everyone to know things will get better. We are in this together... te lo prometo ...", "Lisa is always perfect and amazing she never disappoint her fans", "Marina is a beauty.", "Its ma dream this :o", "love listening this song who else here in july 2019??", "I LOVE ONE PILOTS 😘😘", "best song on the album. I don't make the rules.", "Can't really  explain  this feelings right now,but this song gives me butterflies in my  heart,the sound of a beating heart made  my heart drop", "I wish the song little longer like a another music in 3mnt or more, bcs this is so addicted into my ears..", "This song is fucking lit say no to violent", "I’m Mexican but i still support and love Puerto Rico. We will rise", "BLACKPINK SLAY US EVERYONE", "So good", "This video clip Represent the REAL WORLD CUP!!! Not like shakira!", "I cought feels.", "i was there this weekend! it is amazing!", "Maybe one of the best Eurovision songs of all time. Congrats to these three guys they deserved the win.", "I love this", "1:40 this scene alone deserves an award", "lave it", "good song :)xxx", "Nice song it's feel like we also want to dance 💃💃💃💃", "Best collab 😻", "She is goddam lucky... Coz u r thinking abt her... :)", "Love the song, not the vid.", "I really like this!", "It great great great", "Love sex", "like", "Selena is very queen,MY GOD!", "who gives a shit about American Idol\r\nwe still love cheryl :D", "Awsome video! goes perfect with the song\r\n", "I'm here because of Taehyung", "ah mi amor dedicated this song to mee and its maa favee best sonqq ever<3", "I like your country music very much 😐", "I have this on repeat! Loving it. Nice any which way 💕💕💕💕💕💕", "0:47 is my new alarm now.", "Even if he didn't win the competition, I feel like it's a huge victory for showing your art to the world. I'm so happy I discovered Mahmood, he's probably the first italian artist I really can't stop listening to and every song gives me goosebumps in its own way. You can really feel how much thought and emotion went into writing his music, which I rarely hear in popular music nowadays. Thank you for sharing your art  with us, Mahmood!", "Song cool", "love it", "Jennie the hottest and the prettiest girl I have ever seen", "Great song but probably one of the most boring music videos ever lol", "I love this. But I think the Migos should've been in this too. It's close to their style of rap.... Mumble.", "Pretty queens", "You leaning from the best", "I love this songgg💞 and of course him💕", "I’m dying for Jennifer’s this look with cap 🤤", "The fact that 4Chan hacked a poll with Pitbull and the dude still went to the place in Alaska shows he really is a genuine guy who loves his fans.", "OH LORD OF JESUS THIS GOLD SELUGI is WRECKING MY LIST TRYING TO BE LOYAL TO JOY😭💕", "If only he had a mv for this song", "How is it possible that Reggaton could become more popular nowadays? Beautiful, beautiful, heaveanly music.", "I love this song", "@mizzmuzic13  Armada latina is something like a latin army lol, good song!!", "The real Winners in my opinion🇳🇴❤️", "from BANGLADESH\nlove your all song", "Wish x was there .. ;(", "Namaste🙏 jimin this song is awesome. love from India 😊", "I LIKE THAT ENTITY DRAGGING BAD BUNNY ON GROUND...HE IS SO HOT !!", "I love this", "cool", "okay bad bunny. This song is a fuckin bop!!", "This is on fire", "This is still the best thing since TB Saga", "@MrTotallyoffthehook Hopefully he comes out with  some absolute bombs as he always does!", "dang..he has a show tonight Dec 1, at 7:30 in San Fran, CA:( Wish i could be there:( #mood", "Yasssss it's here", "Love from 🇧🇩 Bangladesh", "Great song, amazing video!! I'm totally addicted to this song. Cheryl is awesome and freaking HOT...", "Love this concept so much 😍😍😘😘", "How to dislike this song??? It's on fireeee🔥🔥🔥🔥🔥🔥🔥🔥", "Lol one of his best songs^.^", "~remeddddy!!! .... Now this word keeps repeating on my head!!!😂😂😂 i love how #jungkook saying word in english!!! 😍😍😍", "very nice!", "cool", "The beat, the video, the lyrics and the perfect combo with Jhay. There’s no stopping Bad Bunny can’t wait for the next songs", "Damn! Song is good :) ", "love your song bad, and drake", "Without Alex Gaudino this song would be awful", "One of my favorites though I've no clues what it's all about 👌", "I LOVE this song   sooo oo  much  at school  I  sing  it heeheheh", "*This song so good I keep replying it* 🤙🏽", "This is cool👍", "This has to be THE BEST video I have seen in SOOOO LONG... Thank you.. who ever you are... ", "I love this just can’t stop watching this who else was on instagram an nicki posted it and you just went like yess finally 🧡💛❤️💖💙", "I love you DADDY", "From my side OneProductionMusicRomaniaOficial I really like the song should be the hit of 2020 With all my respects from romania OneProductionMusicRomaniaOficial", "This song is so addicting 😍", "Great creation by Dj snake and team addicted to Loco contigo", "WOW. Im not a fan of Drake, but he really surprised me with this one. The collab and everything. But its new and refreshing. I like it.", "Thanks for this present Ed!! I'm from Barcelona and I'm glad that a worldwide artist sings a good vibe song about how happy was he in my city. I don't really like the last minute with all the \"mamasitas\" and \"sangrias\", but we have to appreciate what you did cuz what you are really singing is \"Barcelona = Happyness\" and good times. That's what really matter!!", "Pitbull & Lil Jon need to make more songs together", "I think I know who I'll root for, 12 points from Russia!", ".... iM cRyInG why boys why", "Omggg I love the song😫😭", "Have No Idea What He's Saying But Great Song Love It", "what is audio\n we want the whole damn mv lol", "I've drained my battery on my phone listening to this song on repeat.", "lol me dancing and my mom looking and me like .shes like dude your hispanic and putting it over and over and over and my dumb self be like i like it tho and then thinking im dumb like that", "LEGENDS", "Psycho and this song is the best", "I love this song and Cathia's version on The Voice too!!!", "Love this song from Indian fan", "Only BTS can make me cry ㅠ-ㅠ", "Love him", "I'm totally in love with this song and her voice! Great job celine! You moves me! Always!!!", "The most beautiful song❤ makes me picture the day I walk down the aisle marrying the love of my life. Could have an awful day and listen to this and automatically feel happier.", "A minute I see this song is to Billion View!!!. OMG! I'm shock!\nWhy them do it done.very good", "I love this song ❤ \nCadê os BR?", "When ur not Hispanic like that but this song is just a bop...just me okay😌", "Most beautiful  couple", "I love this songg I love youu enrique", "Very Good!  Midzy, up to now 21 hours, average hourly vi3ws is 40k+ and the projected daily vi3ws will be 960k+.  Keep fighting for the coming 3 hours to achieve this!", "i’m proud of being from Miami, where this queen lives & goes to FIU. YESSS", "maluma baby... pretty boy dirty boy", "I love it bro I love it", "Shakira's fucking gorgeous.", "when it ends I replay it like I don't want to end I love this song so much", "This was a good memory....summer vacation watching music vids with my cousins....simpler times", "Bad Bunny you're amazing and so hot :)) \nBye bye  from Italy", "He's the hottest guy ever 😌😌😌😌", "This  is  a  great  Christmas  song.", "Beautiful my Nona will love it", "JIN REALLY SNAPPED HERE!! im so glad he’s been able to showcase how talented he is recently", "Lisa is the prettiest", "BDW Korean soothes ears more than English!!!", "KING HAS RETURNED", "All Poland love this song!", "The original is better", "This song’s a straight vibe ❤️", "The supar song Amazing wow", "PERFECT BOYGROUP,, OH MY GOOOSSSHHHHH", "ok so i had no idea that all of my favorite songs were by the same person but i did not recognize the voice...😂", "I love You Celine! You are the best thought cant understand your French song but still kept listening to them. I wish your Tour in Philippines will go through!", "im crying cause this mv😭😭\ni love they are so so so so much❤️😭\nthank u for make this song☺️😭❤️", "Nayas vocies is so sexy when she sings in spanish", "Kids look at this and take example on how to act. I saw a little boy be disrespectful to a lady because of this video. Psy be a role model and not a complete loser! Children look up to you you jerk!", "Sooooo funny", "Best music", "Great song to twerk to!", "JAJAJA This is really funny, very good !!!!", "Is it me or do I wanna get up rn at 1am and dance?", "Love this song it means a lot to me", "This is the only German Band i know, awesome Greetings from UK 🇬🇧😊", "like", "This song deserves all the awards. It’s a historical homage to the different reggaetón vibes", "Dame Tu Cosita \n*Upgrade*\nHoward The Alien\n*Perfect!*", "Awesome song. But why do they all hate hair so much?", "thank you for everything my love", "im in love with perfect song I love you ed", "Thank you for making music in Spanish ❤️ I appreciate it", "Damn I'm not prepared. I didn't expect this! Omo. Bighit ur da best", "I think that everyone will love drake more if he starts to sing more Spanish", "OMG Momo is the best dancer!!😍😍", "haters: hating\n\nme: vibin' n chillin\n\nSTFU AND STREAM", "Why isn’t this a movie I would helllla watch it", "is a great song", "This is my anthem", "I saw this when I was 13 lol I was like 👁👄👁", "There are three songs, that are potential winners: Italy, Bulgaria and last but not least Portugal. Personally I would love to see Portugal win. The question is: where will ESC 2018 take place. #Lisboa #Oporto or maybe #Funchal ? Anyway, Portugal would be a great host and an city will be fine...", "I love Prince Royce ", "This is a banger. I wish Bad Bunny did more ballads like this because his part was killer.", "I love Romeo, add Drake, its a 3some!!!", "omg is beautiful video", "makes me wish I knew Spanish :O", "And then there me dancing me heart out to this song with my headphones on ( it’s 11:40pm )😂😂", "keep on watching guys  i want BTS see their beautiful eyes and smiles i want them to be happy coz they really deserve to win. Keep voting on MAMA dont be lazy", "Never expired loving it from Africa Uganda", "ahh this was an epic video.. the poor rose though", "We need more of thooseeeeeeeeeee", "i love you :-):-):-):-):-):-)", "This, my friends, is real music!", "It's too bad you don't actually see Serena sharing the same screen with Blackpink, but they're all so lovely in here !", "BYE IM DECEASED", "it is my favourite song :) and this clip is so cute", "love this chik period ", "I love this beat", "Anyone who thinks like that better Gangam Style", "luv it!", "I swear I just love prince Royce he is just sooooo cute 💜", "Haha pitbull song and commerical.", "JBalvin the best🔥🔥🔥", "It's a fun song actually, but I cry over it too😂 I don't understand this song 100percent", "This song is nice but it has nothing to the with the World Cup do they even mention it ", "I Love Min Yoongi oppa.The song very good.Suga is the good boy💞", "I LOVE YOU TOO", "how great is our god", "wow wow wow !!!", "The best song even now", "I love Enrique I wish I could understand Spanish :( ", "SUPER COLLABORATION", "Love the song....but i unfortunately have to agree with some of the comments that this video didn't deliver... I expect bigger and better from the Talented Romeo Santos. I hope he Ups the sexy and the creativity on his next video like he's done time after time with his lyrics  . Una cancion tan linda con un video tan deslucido,", "This is drastically different from the other songs I've heard by them. Still very good.", "TT-TT THIS IS PERFECT!!", "You have to listen Hindi version of this song ( it's just)", "I like the beat and every thing but its RACIST as fuck! How is it people can't say nothing about african Americans but yet here it is the most racist/ stereotypical song about hispanic people?? And NO i do not like people of different race calling me mexican im hispanic. Only family and friends can call me mexican or say it but this song just!!!!! Gets me so mad and makes me feel disrespected to the max!🙅🙅🙅🙅🙅👿👿👿👊👊", "I love Marina and Clean Bandit and to be honest Luis Fonsi's presence only made the song even more magical", "y’all are literally so happy and i love it 😭", "Beter than good SNSD", "And people wonder why I call him the best artist of all time, his discography and his production is simply Untouchable", "Nice Daddy Yankee good going you favourite for me.", "Those screams at the end... i feel it✨✨", "usher is just pure talent, and this romeo santos is growing on me.", "Bebe is soooo pretty! and she's really talented! I love her!", "R.I.P french language ", "I just like the song..wish I could speak Spanish ❤️ such a beautiful language❤️", "*currently crying in a corner*", "I 'd like to dance with you with Bailando song, Enrique.", "Very funny video story.", "I can't believe Pitbull would make something like this.. :P too funny :D ", "tonight when i go in disco.. i hope they turn up the volume with this song <33333", "I love you 😘", "I don't understand the language but i love it", "ALL OF THEM LOOKED SO FUCKING GOOD I-", "awesome", "Jin at the minute 3:18 did he kill me alone??\nWhat a voice❤❤❤", "I like this song 😍😍😘😘", "listen bc i would only say this once... Chris brown is talent in the flesh, periodt. argue with youtube.", "Nick was VIBING! We love to see it", "ON \nBLACK SWAN\nBOY WITH LUV\nARMY STR*&M\nFIGHTING\nWE LOVE YOU", "Imcomparably fabulous duet, vocal delight of stellar  supreme...", "Marco Antonio Solis is the best!  yeah!! god for Enrique", "i love bad bunny", "El dream team 🙏🤘🏽", "5 years later this song sounds as good to me as when I heard it for the first time...if not even better! Anyone else (May 2019)??????", "Just wow, Ozuna on another level with this one. The Latin Marvin’s Room 🔥", "Already see the hottest music video for this song!", "I don't understand French but I love this song, hope Celine can do a English version.", "I don't know why you hate PSY\nI know PSY is popular,but you couldn't attack.\nthis song is especial song.Not unnatural song", "Super fly guys, I admire this type of musica. Drop another video! With Shakira included lol", "I dont know why I always get emotional when hearing this music .. Its just so great", "This is literally Blackpink's and teddy's best work period", "THEY LOOK SO GOOD!!!!", "Soldi! To my kind this song deserved first place at Eurovision song contest 2019. Mahmood is so cute, has a personality, appearance and another inner skills.❤️", "I love it amazing song", "9 176 peoples are idiots ! fuck off haters ! :3\n", "This is plane fire I like the beat it makes me want to dance as a Hispanic I'm very proud about this song it's really good", "oh my god wow", "love you black pink", "MY HEARTS ON FIRE FOR YOUR LOVE", "Me and my mom love singing this song in the car", "I have to admit, when I was watching the finals I was SO angry that Portugal won over Bulgaria! However, I cannot stop listening to this song!! Read the English lyrics! It's so touching and beautiful. Salvador's voice is so beautiful! I'm happy that Portugal has gotten their first win!! This song is so beautiful!! :)", "I don't understand anything he's saying but this song gives me chills mhen.", "The Netherlands had to win!", "I really like this song+ the video and choreography<3. I'm not a Midzy tho^^", "Memories r made of this", "Crying in the corner of my room ㅠㅠ", "What a nice collaboration dang. Good work guys.", "MARINA BACK TO SINGING IM SO HAPPY IM CRYING", "People hated this album cuz he spoke truth. He’s saying blacks are now slaves to white men through material goods. Mental slavery.", "Great song but.... I could have used a little more cowbell.", "ahhh i really feckin love this song !!!!!\n", "I found this song by accident.  And no regrets at all", "Your are the best 6ix9ine forever", "How old is this chick? Goddamn she still looks finnnne", "Wanna cry because of how atractive they are . Jim ,Jimin and v are my baes .", "Very nice song", "My soul cries when I listen to this song! This is real music! And Portuguese language is adorable! Greetings from Bulgaria!", "Original song and this Remix are awesome but Justin Bieber should've done more in Spanish! Perfect timing for the Puerto Rico show of his world tour, April 18, 2017.", "Ok but i'm *obsessed* with this song", "This is the best song ever 😂😂😂", "I love this song", "OBSSESSED WITH THIS SONG", "BRAVO FOR VERY, VERY THE BEAUTIFUL VOICE !!! BRAVO FOR VERY, VERY THE BEAUTIFUL SONGS !!! BRAVO FOR VERY, VERY THE BEAUTIFUL MUSIC !!! SIMPLY ENDLESS THANKS FOR THE BIG PLEASURE !!!  With love Nadya Mirkova  - Your ETERNAL FAN FROM SOFIA - BULGARIA - EUROPE", "i love", "This song is incredible, and this video is so fucking good I just love alt-j can you tell", "love the song😀", "This thing is still going r u joking", "I love dis song waka waka :-)", "You make me feel special!", "JEENE IS THE QUEEN", "Thank god finally! I love you jlo  ❤️", "Oh mah ghad, my queens slaying again with an outstanding performance. Deymm!😍", "Truly a fantastic album. Long time since I have felt so excited about a new album. A lot of Radiohead in this one as well. :)", "nutcracker low key popped off here", "0:51: Probably the hardest that any Kanye Song has ever gone.", "Yay!! Another song that will be no. 1.", "#2 on trending in Philippines! 🇵🇭❤😊 Keep on slaying girls!!", "Awwwww...then when football could move me....I remember we used to skip school to go watch the football..when we come back then our teacher would cain us...I remember Ghana played to reach quarterfinals then Suarez and Uruguay destroyed us...hahaha...and wow this is where shakira and pique met...so after all this if people still treat us Africans bad it really hurt..cos u see we are such lovely people 😊😊😊😊", "Dear bts,\nThank you for teaching how to love myself,Caring,Respecting others,!\nI just wanna say i love you i will never forget u even if ur far away. <3..\n-Army💜", "*Wait why am I* -crying- 😢😢", "I really like the rose part...\nBut lisa is my bias love you lisa..jannie...riso..jisoo..ladygaga", "Damn I love this music video cuz my dream car is there (gtr skyline r34😍)", "this is my fav song", "i don't understand anything, but this melodie is so heart warming", "Omg!  I love this song", "cant take my eyes off <3", "the fact that he looks so much like Zayn and both are my favorite ❤🔥🔥", "That sound put me horny", "Daspasito is best", "Dear ed,\nI Love these songs .. but I really like if u can release songs like BEST PART OF ME / ONE LIFE (Release on November 2019) /Tenerife Sea / Photograph /Thinking Out Loud /One /    Castle On the Hill / Lego House / Small Bump..etc....\n\nCoz those songs are never die .....\n\nThank you ed... u re a legend ....😍😍", "ok but i dont think bts know how much of a bop this is\n\npls just sing it live 😔✊", "Omg....they sang so good....I love jin's voice his vocals were so good...for real....#anARMYforever", "Very nice song", "Sexy Nicki + Hot Jason = GOODBYE MY VIBE I REALLY LOVE THIS SONG!", "I don't know why, but I'm crying when I watching this T___T So love it <3", "Love from Pakistan", "shut up you are funny", "nice", "This concert is very stylish and very sexy. Exactly you.", "I love this song but every time i listen to it i cry.", "🇯🇲🇯🇲 love this song", "does anyone knows what is the title of the song (?) that yoongi is playing on the piano? or is it their original? i really like it and would like to listen it more. thank you in advance!", "Well this just melted my heart 😍", "easily the greatest music video ever made!!!", "Pretty awesome to hear him sing in Spanish 🤙🏼🤙🏼", "damn -  Pitbull is really sexy!!!  hawwwt song xo", "Very nice to dance I love", "I felt the lyrics", "This video is so sweet", "Wow! BLACKPINK", "jason is one fine gentleman", "Dang your Spanish accent is amazing!", "I love this whole movement❤❤❤", "i love sing ", "I like the dance", "Who love daddy yankee and anuel", "Is this heaven...?", "i love the beat", "I love you", "nice video GANGNAM STYLE!\n", "This song is definitely more mature than their older songs. Their finally growing up! Really enjoyed this comeback.", "Lawd..plz let me look that awesome after 40!!! Lol\nAmen ", "Still catchy", "I love this song", "Anyone else watch America's next top model? I think Dom was in that video Lool ..... \nGood song btw lol", "Love this song ❤️", "I cant get enough of this song like dang its really good loved it!!!!!!!!!!!❤❤❤❤❤❤❤❤❤❤❤ Your the best Selena......", "That was kind of scary when that big ass head came out that hoody. ", "This has made me patriotic for Germany, for some reason", "Drake sucked Jamaican culture, UK, American, now he's onto Spanish loool", "Who's thinking french language is so charming ? ( oui je le parle ^^ :) #TeamMia :p", "Better than the other 1D guys", "I love this Song 💯", "This comeback will be the death of me ❤️❤️❤️\nUr quicker than my WiFi😂", "addicted to this song. :o x", "At first I was like wow AMAZING song! But after 2 days and listening only like 5 times I’m  already tired of it. Especially the refrain gets kinda annoying imo.", "6x9nine n ozuna would be a another greatest hit", "original is better", "This song is it’s own vibe", "Am I the only one who didn’t like the beat at first but now I can’t stop listening to it?", "Yg done it again holy fuckk", "My love is song", "i like this mv so muchhhh", "so damn glad to hear it😭 bcause I've been waiting for the official version of this song❤️❤️", "Well looks like I'm going to fangirl for a while. Bye", "I'm obsessedddddddd...I can't stop listening to this song, please help me", "I'm getting a Maze Runner or Hunger Games kinda vibe from this. Which is cool I might add.", "This is so so good I have this on Spotify I love it", "They were best.", "I love you ed", "To me, Jimin's part at 1:00 is truly the highlight of the whole song. \nThe second Jimin starts singing is like a revelation, everything else just fades away.........", "Love Enrique in this song!!! :D", "Omg ♡ perfect ! The song type i was waiting for a while now ♡ reminds me my high schools vibes days! And with David  Guetta !! Omg ! ♡", "triumph.", "like the song, but not the video", "J Balvin the boss🔥👑", "I love you", "love", "Awesome song.Just loved it <3", "Waiting their dance performance and stage, coz they dance so lit", "Foreva WakaWaka the best world cup song. Love Ya`Shakira!", "litterally falling for u, your voice, your songs ahhhhh", "2012 me a 10 years old listening to this song in every cafe and resort I go to. Life used to be simple and easy:(", "wow.its really amazing!", "Such a sexy song, even if the lyrics are ridiculously macho...\"the address where I made you a woman\"....please! 😂", "Like you video", "i like this song filter jimin", "I'm literally crying 😭. Such a awesome song......", "I don't know what you people are saying but there are a lot of boobs in this video so I can get behind this 100%", "LOVE YOU MAN!", "his musics tragic now", "Love this video <3", "The best collab eveeeer", "i prefer Nadine's new tune!!!", "Naaah something missing ......😭", "New Zealand fan big time", "they gained SO many popularity because of bad boy. so proud of them 💗", "It is was nice song ", "THIS IS BEAUTIFUL", "Who else likes it when cardio b sings it", "Our baby angel.....V ,we love you", "Ilove you prince royce you is my baby te amo prince royce", "What is the probability that a person falls in love with another person's voice? 🐥🐥🐥🐥🐥🐥🤔 (not like an ordinary fan) 🥴", "After being on the floor at Madison Square Garden last Friday night I can not listen to this song on cd.  It just does not do it justice.  It was amazing, energetic, and sincere!  It is a shame that everyone can not hear it that way.worth waiting 10 years for lol :) ", "am watching this video all the day  omg ! love ya", "The best!!!❤❤❤", "1:30-1:50 was everything", "Jimineeeeeee you nailed this song with your line your touch your touch 😍", "103k tasteless people.", "Ursula ❤️ Love the song ❤️", "MIKA love", "Maybe one of the best songs ever written. Worldclass", "Could i hear this song live performence once in my life? please! Bighit please! Performing on concert must be amazing!!", "I don't know what to say\nIt's amazing", "superb", "I love it", "2:52 - 3:50 genius. I love how creative he is.", "7+7=15 right no its not your not funny   HA    FAIL!!", "ARMY why stop streaming? this is sad...", "Fuck yeah I love this song! and the video. She is absolutely gooorgeous!! :)\n5/5", "Im dead 💀 lol but I love the video!", "This song makes me want learn Spanish :D ", "beautiful song I want It is good singer", "I think the superiority of BTS's korean lyrics over their english ones is visible in this song.", "good", "The beat is awesome!", "I like the title so much 😋😂😂😂😄😅 it means a lot.  lol", "It's so amusing to see how Ed doesn't look comfortable doing video clips, he's not the entertain and be a fuss guy, but he still gives us nice music videos cause fans love to see him and have vids related to the music ❤️ thanks Ed ! Amazing artist and great man", "THIS SONG IS A BOP!", "love this song its my fave :) \n", "I think it's amazing how ed sheeran could have two artists from different countries and make a awesome collab. He has such an amazing mind!", "love this song", "this is such a meme i love this", "I absolutely love this man and his beautiful spanish music. So classy and romantic, his father as well. They both are my absolute favorite and i hope he never stops making music like this. Music that has wonderful artistic talents and wonderful melodies, nothing like all that lady gaga crap. ", "Ed Sheeran and Paulo 🔥", "The best of the best 😁👑🔥💥💣🇲🇽", "Best summer hit!!!!!!!!!!!!!!!!!!!!!! SHOUTOUT", "I listened to this song 100 times and every time I cried again and again.. Miss you papa.. Rest in peace💔", "I love italian languae .\nL,, of songs .", "heartbreaking..such a beautiful land & people ruined by ignorance & prejudice..well told by the Irish genius & Italian legend. x", "This hits different.", "Damn, that guy is a badass", "I am doing a party with this music it is lit", "lovely and  you sang the same pieces at prince harry's wedding that was sung at mine  back in 2012 lovely you  warmed my heart as we lost our son at age 35 in July of 2018", "Soo cute love 😍😍😍", "Y love you", "I love you jayson", "dope vid", "1:05 Rosé 🌹 is too beautiful even in cry ❤️", "i hate french but i love this song finally i found good french music cuz i m studying the language and it was getting hard and boring to me lol.", "HOME” TRACK INFO\n\nProduced By\nJulia Ross, 송재경 (Song Jae Kyung), Krysta Youngs, Tushar Apte, Lauren Dyson, Suga (BTS), J-Hope, RM & Pdogg\nWritten By\n송재경 (Song Jae Kyung), Julia Ross, Krysta Youngs, J-Hope, Suga (BTS), Tushar Apte, Lauren Dyson, RM & Pdogg\n\nI stan the rapline😍😍😍 RM, SUGA, J-HOPE \nSince im a Hobi bias, I noticed a new flow on his rapping. This man is unstoppable.\nAnd this song is epic😭😭", "i love this song!!!!!! (L) (L) (L) (L) xdxdxd chris brown sings brilliantly!", "I love it song", "c'est beau.. I need to learn French like asap so I can get full benefit of these new songs! :)", "I love this song soooo much", "Zabdiel with that ballerina spin 😩 ooooh ok I see youuu", "I love you songs", "2:31 - 2:32 pitbull without sunglasses ;) nice eyes pitbull <3 :D", "I'm really proud be the part of ARMY ❤️😭", "The best loved from the start always in my heart.x", "amazing song (: ty", "lit boi", "Bad bunny is the 🐐", "love this one", "super", "This song is just amazing i looove ! This duo is so beutiful ! THE MV THE MVVVV !!!😍", "This man a little nutty but god hes a mothefucking genius no rapper can touch the man", "*Espanõl Song of the Year!!!* \n❤❤❤❤❤❤❤❤❤⚡", "Beautiful song", "That is not true my favorito singer is Enrique iglesias", "Im in heaven", "I’m so addicted damn...", "i hate french but i love this song finally i found good french music cuz i m studying the language and it was getting hard and boring to me lol.", "Cold days and this song keeps me warm ☕️🍩💛", "wow!!! Amazing.Both of u really amazed me with your nice voice..😘😘", "Everyone just nailed it😍😍good job", "Seriously what the fuck", "this is on the new rock band 3!!!!! its awesome!", "im brazilian...nd this song is awsome lol", "Kanye himself said that the second verse of New Slaves is the best verse in the history of rap. Certainly the best verse he's created", "Bad Bunny is hot af for this", "My brain melted 🤣🤣", "2:00 WOW this transition was smooth af slay us Taehyuuuuung", "Anuel went hard on this 👹👨🏻‍🍳", "Another epic song as usual ......", "I like", "Anitta amazing!", "If Our little baby prince taehyung was a farmar. He would be the most good looking and lovely farmar in the whole world. We all love you taehyung", "I love when Ed sings in Spanish, and I love this song more than anything.", "REAL WINNER Norway was ROBBED", "love it!", "noooooooo!!!!!!!!!!!! It no longer maintains the beautiful vibe when it is in english, spanish version way better!", "I'm died", "Greek flag omg yaaaay xd", "WOW! Sin palabras..... Thank You!", "amazimg!!! Hi from Russia", "😍😍😍😍 love it", "Who is this song so underrated !??", "I dont understand french but its such a beautiful language. Love this song.", "THIS is the real song. Holy fuck. Goosebumps all over my body. Absolutely love it", "The best shit ever", "Bravo ...excellent \n", "Awesome sounds...", "It's been more than a day but i've been listening to it since its release!!! such catchy and nice song with matchingly beautiful concept and lyrics💖💖 i just love how they went from \"boy in luv\" to \"boy with luv\"!!! their growth!!!!", "best song", "DONT TALK TO MEEEEEE..IM CRYING😭😭😭😭😭😭 ITS SO AWESOMEE..FANTASTIC!!!", "Dr Ofori's Rmx put me to this. Epic tune", "EXO-L here to support BTS ❤ proud of you boys good job 👍👍"], "neg": ["It did the vocalist get stung by a bee and forget to inject himself with his EpiPen", "uhm what?", "so this guy doesnt know shit about cars and he makes a song about them", "I prefer Madonna´s version which is the original, though this version is good too", "This is a really mediocre track aside from Fab's verse... Not sure what the fuck y'all are freaking out about. The beat is alright, Meek's verse gets pretty annoying after 20 seconds, his hook is nothing special and the Anuel \"verse\" felt forced as fuck. Didn't fit with the beat or song at all, just kinda felt like Meek threw him on there to speak to the Latino crowd. Hope the album goes in a different direction than this.", "Why snopp dogg why", "All your song are the same 😏", "Only came here cause of Liza Koshy", "Tekashi get creative...i mean your latest songs are almost the same in the video....creatify your work bro", "1.Go to window \n2.And jump.", "no", "Korean age system is confusing the hell out of me. Like just tell me their ages and be done.", "What the.....", "He German try to speak Spanish be like : jajxhdbfkwduakbr...       iS iT rIgHt? Hahaah", "How do I get the English version", "3:59 why would you put a village scene for Africa like we dont have cities and the rest of the world doesnt have small village like settlements ..Smh in disgrace", "These guys are not German and don't deserve to call themselves German", "What a shit ! Oo", "Blacpink 💖\nBut unfortunately  it is bad\nBut i like blacpink 👎", "This guy kinda sounds like the Spanish version of Mickey mouse", "almost the dopest video ever but..latin song... WHY?!", "THis won just because oh the handicap card, the song sucked balls", "That fact he got the original \"Macarena\" guys at the beginning is epic", "Not feeling it. It's a bunch of random artists on a song. One of those songs that might grow on me later but now, not feeling it.", "I Hate This, because It's Every Ad On Youtube. AHh", "Basically another  bad bunny", "English please", "So drake is doing this now? Singing full songs in spanish? Good lord", "I don't like the music, but wow, bieber's  pronunciation in Spanish is very impressive", "Without Fergie the group is like shitty boys clubs of the 50s", "Lycris - i don't understand a fucking thing \nBeat - takes a big L \nBithces are the best thing in all of this", "Ppl think trash rap is soemthing new lol it’s BEEN around", "@shanosha1 \nthis song is beautiful !\nbesides rihanna's dreadful vocals ; it goes nice with the song \nbut it honestly sounds terrible .", "is it just me or every blackpink song before this looks exactly the same lol", "this is trash", "If you make a song for a primarily american audience, speak english", "I literally just came here to dislike", "pitbull suck enrique is amazing.PItbull Romania FUCK YOU", "Kendrick one of my favorite", "flop", "I’m glad I waited to listen I like everything but the song itself it got so creative until words hit the beat 👏🏾 I almost love the effort", "I have no idea wtf these people are saying", "Is this really still popular", "What\nWas\nThis", "Andrea, please sing the lovely Italian melodies and not this boring and trite song! You are so good...", "haahaa this type of songs is getting 1M view.Where are you Jesus?😷", "My favourite part was when it ended!", "When I heard this song on the radio I laughed. Cuz it said “BAABYY AAAAOAAOOOOOHHHH”", "This? THIS Is Hell.", "The Spanish nigga ruined the song", "I can't take this song seriously thanks to QPark 😂", "this is more worst ! -.-", "WTF?!! I expected sooo much better!!! So disappointed!!! :(", "J Lo is a bitch", "Am I really the only one that has never heard of Marina until now? And what's so special about her? Btw I'm not saying she is bad, she's just not a \"Goddess\" 😂", "Pitbull is Spanish right?? If so FIFA should of went with someone who is local.", "I like Dua Lipas part but the rest is trash", "Pathetic. \nIndictment of our society. \n", "The video edit is better than the song", "This dude was trying to make a Despacito 2 and copy X’s I don’t speak Spanish lol", "Can someone say autotune AF?", "Shame he copied the music from Khaled - C'est La Vie https://www.youtube.com/watch?v=5dWeeUIZFgA  \r\nand has more views !!", "All American artists are SHIT. From England", "Shit bro", "This bunny dude sound like got a carrot up his ass", "As I get older I realise how weird this song is", "Drake said baby one too many times😂", "The whole fucking Spanish songs only have 1 beats...what a musician you all are 😂😂😂😂😂😂", "Spanish video trending in America!?.. A sign of a new wave of Mexicans jumping over our border walls", "Yaviah ruined the song i skip it once he starts", "what the fuck is this....", "Bad bunny getting too soft and too commercial", "I Was The 360,000 DISLIKE!! YAY COMMENT IF U HATE THIS SONG!! :)", "Yo daddy yankee did you check Eminem’s new album? he killed all these mumbling rappers reggaeton nowadays is bullshit you should bring back the old you", "he should of sang in Catalonian", "I love personal ❤ , i hate thiss 🖓btw i litterally that i heard is thus you dont know my name tho🖓😂🚫???", "Jon Z mary jane > kippy kush", "what the f.....uck", "How the fuck does this shit get 39 million views ", "Wow this audio is fucking awful", "this song sucks ,he made this song to get a jlo ...real men dnt fight w women or embaress them ....", "The song is good but maluma ruined it", "hate that there's no subtitles as from England and won't understand Spanish. puts me off of a song. eds voice tho 😍", "Can we have a version WITHOUT DJ Khaled?\nFFS... ruined ANOTHER ONE!", "I only want to listen to english. in autoplay how do I stop youtube from including videos/songs in other languages.", "It Kills Me When Bieber Says \" DES PA CITO\"", "Wow i guess they sing in english now", "Watching this is making me laugh", "the american music is better than this shit....", "Kanye west is really a gay fish", "This dumb fuckin cover", "I speak spanish and even i can't understand what these two fools are saying.", "Bohemian Rhapsody is very cool\nCon Calma is bad", "This song lika a shit", "anitta version is better", "Make this stop all ready!!!!!!!!!", "This is ripping so much from the 90210's music video.", "African dress style and African music is taking over the world. I can see African style all over this video...🔥🔥🔥", "What’s with the fruits", "I'm fan of skrillex but tis is totally bullshit dude", "I hate this song. ", "pitbull suck enrique is amazing.PItbull Romania FUCK YOU", "Holy shit more auto tune than any other song ever.", "I hope this is you last song", "Marina is amazing here! but Fonsi is not needed. It's like they put him into the song with no reason. Luis Flopsi.", "It isn't music ", "definitely better without the spanish insert", "little bit too much autotune if you ask me", "I dont like it :( I dont know why. I preffer Fire or Dope. sorry", "Some weird song switched to many times from Rap, old rap, Spanish and R&b", "This is the worst comeback of Blackpink ... I hope next song will be better! Fighting , Blackping!", "This sounds lowkey good on mute", "See You again is better", "BAD MUSIC VIDEO", "TERRIBLE MUSIC FOR TERRIBLE CUNTS ", "Audio sounds like shit!", "4.2 billion? What the fuck", "beauty nd beast..omg pitbull ugliest dude ever", "THAT`S just a BIG S***", "i ain’t gonna lie i’m disappointed... waited so long for this..", "i only came here to listen to this and have a laugh because its so crap and totally bombed. it has nothing on simon cowells 'everybody hurts.'\r\nhahahahahaha.\r\nhahahaha.\r\nrihanna, you cant sing.", "Would be good if it wasn't in another language, that's just dumb", "Justin bieber is back for singing song of others and fucks all the song!!!", "That’s a shit in stronomic levels", "This is trash", "sucks", "Damn! Fucking Pitbull in every god damn video! but anyway I love Cypress hill!", "Jlo is such a clout chaser. She changes her image to whatever is popular.", "Piece of shit, wisin the worst.", "what a crap video for the song.", "Wtf is this? Giving PR a bad name 😂", "I know this old but i rememeber when my friends weere dancing or singing this bull", "cardi b is wrecking it in all her albulms", "It's not even ORIGINAL", "This song will be better if you make a Ft. Alemán", "The song is alright..but that stupid glasses are pissing me out...", "Sounds like every other tyga song amiright?", "Dj Khaled is promoting obesity with all his collaboration. Can someone pay him a trainer and plastic surgery?", "Wtf that it", "why is this trending in the US", "So now if it’s not a reggaeton beat is not a hit...", "Pitbull sucks ass", "Skrillex ruined this. Zhu is far more talented. Needs to make music himself!", "who Gives a flying Fuck about Macklemore.", "Spanish guy ruined it", "like fuck", "what a bad song", "did youtube just freeze the views again 😩 i hate snakeu", "THAT`S just a BIG S***", "Go away Miley, nobody wants you here.", "Are you serious...\"Haitian Gods... had to sacrifice many to shed life on all of them.\" How can you be praying to God and saying Haitian Gods, this is some bullshit. I am so not feeling this. Jayz basically went against his blessing and prayer for the country just from his first line. Have you every prayed for anyone and referred to them as Gods?", "i am here just for the hot girls...shit song tho!!", "wtf was that english?", "i feel bad for the husband hahahahaha", "bad bunny canta horrible ._.", "Yoooooo!!!da fuq is this shit!??!!?", "To much ass", "Fuck you", "The only good thing about this video is the girls", "do the lyrics even make sense???", "Me gusto", "i don’t care what anyone says i refuse to believe that harry wanted anything to do with camille she seems like an awful person \n\n\n\nthere i said it, disagree with me if you need to", "Jonás brothers doesn’t go well with Karol G or any other singer . They are good by them selfs!", "Hate From Bangladesh", "Am I the only one who finds this song really annoying lol😂", "Horrible", "The new song is trash compare to shakira's and this....", "The pitch tho screeching is it like this in all your songs?", "This song makes cancer sound good.", "J lo sucks. She sounds so stupid trying to speak Spanish. Old ass fart still trying to act young. Ugh she irks me lol CARDI B❤️", "what a freak video🤔😮", "Would be better without Mia Martina.", "Brutal bro", "wow the perfect duo the two pervs....", "Meek mill know this album cover trash smh", "I don't like this song very much,DON'T HIT ME CHRIS! (c what i did there?) ", "This song woulda been better without the guy tbh i dont really fw malu but not ganna lie her music sounds pretty good", "Usually I really adore both J Lo and DJ Khaled.. but I hope they realize that Cardi ruined this song.. as usually... it kinda became her job honestly", "This is irritating and just about the opposite of heartwarming.", "what the hell happened to thai kind of music and these kind of bitches wow dog i thought your slight change attiutude would last but nah you lost the bitches and the beats", "wisin ruined the song", "Tygas hair ruined this song for me", "Dislike, can't see Lorenz with boobs", "Horrible", "Nicki is such a bad singer;)", "I never heard BMTH ebfore, but is this Oli doing the guttruals? They soudn BRUTAL.", "Horrible!+", "garbage music", "He‘s hot, but every song seems like the other ... Sorry Maluma", "If JB didn't appear in this video it could be better.", "This Song is a SHIT..😂😂😝\nLATINO HIJOS OF BITCHES😂", "Yo the lyrics are so weird in this song", "All of these songs are so fucking boring and generic. If she weren't so hot, there would be no fame here.", "Brazil is the worse Brazil team the world have ever seen!!! Germany to win if FIFA allowed!!", "Why is this karol g person on the tune it ruins the tune idc if u man are Spanish but the burna boy version is so much better", "lil jon makes me cringe everytime on this song", "Mary does not have the right voice for this type of singing. She sounds way too fuckin nasely....She needs to stick with RandB...... Bocelli's voice wasnt on point either .He was flat on the higher notes.\r\n\r\nThis was a so-so performance. Memorable for all the worng reasons..", "Listen to it live.\n\nThis sounds..... rushed."], "neu": ["who else is listening to this right now??", "no comment 😶 wow\nyou really are awesome \nit is myth\nbad boy wow \n😍😍😍😍😍\nin mintes 1: 36\nerin is so  nice wow ♥🔥", "He puts JLo in a video, then a girl is using her infamous Versace dress in another one. If you’re so obsessed with JLo, why didn’t you put her in a song? Damn", "115M vi3wx before this month end? Let's get it!", "why i always watch this video. myghadd jimmin so cute", "y is this the link in the one direction videos.", "la AMO", "Bad bunny will always be a person with not that much views in my mind I don’t want bad bunny to forget his origins", "Oooh Weeeh!!  Them biscuits got a whole lot of 🍖", "I'm the English comment you're looking for", "I have a dikaaa", "Who is From Spain ?", "Which song of yours means the most to you and why? \nAnd which is your favourite song from Bad Bunny?\nTe amo mucho <3", "he got the yeallers", "#ForaTemer", "I got here from the pen pineapple apple pen video and now every is speaking spanish", "at 1:40 he looks like he needs eye surgery lol ", "I love Daddy Yankee from Italy🇮🇹", "who already memorized the Spanish lines???😂😂😂😂", "Army let’s go ,we wont 700mil", "This guy looks like every single character, in any skyrim save, I have ever had, 99% of the time.\n\nSo many freaking arrows.", "Who is early?? And who is an true ARMY?? Purple u BTS LOVE YOU VERY MUCH <3 <3", "let’s be the first girlgroup reaches 400m🎊", "I gonna slam a latino girl to this song tonight", "Where is he now ?😭lol", "yoongi is such a player lmao", "Who is here 2019", "#8 in INDONESIA", "That 24/365 episode where Jisoo drew that giraffe killed me 😂. This video helps us better understand our girls: https://www.youtube.com/watch?v=W1LPwrtDD_c&list=PLUwFr7dGodBgGpiTBexVPNvsU_-VS1AxK", "my sister said she will buy me a dog if i hit 400 subs.... please HELP!! im close", "4:26 thank me later", "i've known this song for years, im glad stays were introduced to this from chan!", "Hope is trully a dancer... gosh the way he move that legs n body duh!", "Why did you delete 5 million views?", "Bad bunny shoud have a song in Fast 9 album...", "aint that kind of a putton :D", "I liked this video for jason n willy not for nicki ( hoe ) !!!", "niece", "PLATINUM HITS", "which language is it ?  the introduction ? ", "You guyses english has gotten way better 😘😊🙌👏", "RIP replay button😍", "Leggo to Youporn now.", "Im From Philippines ❤", "We need 600k views in the next 6 hours, keep streaming everyone. 🖤💗", "Hell yeah", "THIS NEEDS TO BE AN ANIME INTRO", "Can wee get new song to 24.\nJuly??", "2:07 Why am i laughing?XD", "I watch this IDOL everyday😊😊😊", "I came here to practice it😂", "YES ALREADY 6 MILLION! WE CAN DO THIS BLINKEUUU", "First time see this clip ♥️", "no one\nLiterarally no one writer\nEveryone:comment this and get nothing of likes 😂😂😂😂😂", "Basically she used black juju to get her bf back 😳", "2016 and ever....", "173 views", "HOW ON EARTH DID HE MANAGE TO GET LEONARDO DECAPRIO FOR THIS?!!", "me meo", "Move cellural movile homework notebook moreless motorbike alow was easy diff same diff brush bus wash  have finished finish start win lose loose find a shower", "Me for the entire video: FUCK IT UP HOOOBBBBIIIIIIII!!!!!!!", "whats he saying? starting 1.18", "Mika plays a good James Bond.", "Do you want to make THOUSANDS OF DOLLARS per month,no a few cents,without investments?\nDo you want to buy something and you dont have enough cash?Now you can satisfy\nyour dreams,follow this link to find where to SIGN UP and start make money with the\nelite of the most richest people: ( after youtube.com add this adress part: /watch?v=Ig1Jv19_ReE  ).\nBe a SMART man, not a losser like the rest of the pauper peoples,get RICH now!\n", "945,555,701 Justin Bieber-baby\n\nNot much and bieber get's owend twice :D...", "Tears are falling.", "This song is so powerful. Brings all back together. We are all one black, white, yellow etc... No matter who you are,  lives matter. Only one word wins LOVE❤", "Black n brown pt2 yee", "Yes beeech I’m here after the Half Time show 😂🤩🤪", "0:22 my love video :X.", "Rest In Peace.", "blinks vote to blackpink in AAA we  are now number 6", "Wow these days Chris brown is realy hot and cool sa well as pitpull they look good together", "The blond girl looks like rebekah from the vampire diaries", "he didnt say Weed once!!!", "One more fruit by Harry STYLES", "Comments are crazy!!", "i think it's antonio banderas", "99% of *You* won't read this but...\n.\n.\n👇\nYou are the 1%, *I hope you have a great life with a lot of happiness!❤*", "i never get thumbs up when i say to give me no one give me =x", "Look nicky he no scared", "lets get this to 200/300M quickly v33ws so it will get nominated for SOTY", "Streaming since yesterday 💓", "Why was pitbull only relevant from my freshman year till junior, '09-'12, but nothing after?... same with Usher", "I can sing just like him 😒", "Cypress Hill made the song, putos. :D", "it's 2021 and I just discovered this song existed.", "mesmerized by BTS", "Reminds me of the old PlayStation game, Driver. Except cel-shaded. And B&W.", "We need another World War", "All tyga raps about is girls🙄", "I’m I the only English commentator?", "Okay? Which version of Mika do you like the most? 😂", "This bed is bigger than my house oml", "Bad bunny baby", "We need a wedding now anuel y karlo", "Janeth is on the floor 😎", "my dick is big", "Did this just come out today??", "Can I get a coment reply,   from an honest virgin women , please?", "29 Million BLINKS!", "Drake post malone peter pan", "sorry chill time ;) hahahhh\naaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa", "cool >>>>>>>>>  watch?v=MVzkwwwRCx0", "tumbs up if your watching in 2013\n", "dynamite is now the fastest mv to reach 10m vws in just 20 minutes", "the floor is lava!😀", "Help me report this non sense comments. The views got frozen because of those spam comments.", "If they wore the same clothes\nI think i dont know which one is Liam or Jbalvin", "my friends wedding song 💑", "Greetings! Enjoying your day? 😇", "THEY ARE SO FUCKING HOT ESPECIALLY TAEHYUNG AND YOONGI", "Que flow", "Im gay now", "another world record, @ozuna  H7", "1:00 the way he looks at her tits", "Vote for TWICE\n\n2019mama.com", "Bad bunny and jon z would be banger", "See my arrangement in fingerstyle guitar for this song", "Where my English speakers at", "2017 and still listening to this", "wow wow", "Private Video 18+\n http://g2fmXeDEIM.mcdn.design/epgxgRoS6b", "THIS IS WAT HAPPENS WHEN 2 WORSE PEOPLE COLLAB..\n\nWORST RAPPERS + WORST LYRICS = WORST SONG EVA IN HISTORY..\n\nIF TODAY'S MUSIC INDUSTRY HAVE RAPPERS LIKE PITBULL & FLORIDA & SUCH MEANINGLESS SONGS THEN GOD BLESS US.\n\nP.S:- THANK GOD MICHAEL JACKSON DIED B4 LISTENING TO HIS PART IN THE SONG.,. LOL", "The best video of 2019", "A world of candy 🍭I’m sold that’s my dream 😍", "Listen from chi-town chicanos stand up ....black power brown pride...all day every day", "Searching for an English comment😅😅", "wow", "For many years me and my dad would drive one state away to pick up my grandmother to bring her to our house for Christmas. One of the memories I have is us counting how many times we heard this on the radio going there and coming back home. One time they played this song then 2 songs later they played it again. We had a good laugh. I miss my parents and my grandmother and the great times we had at Christmas. Great memories...", "Who before 1 million??", "This porn video really has good background music", "The member with literally the biggest hands holding on to the baby girl. Wholesome", "Anyone in 2019???", "Number 14 on trending in Malaysia!!!", "Hi fellow armies, let’s continue to support our boys. Let’s keep streaming", "No joke, want this played at my funeral", "i like that \nyou like that\nso lets be crazy....", "PROMISE THIS ! CHERYL COLE FAN :) ", "Best listened to at .75 xept its a bit robotic", "you take white to another level", "I’ve never seen a video on YouTube with 1 Bill views !", "OK Hold Up...i cant be the only one that heres could you be Loved by Bob Marley at 2:05", "SIP DESPASITO", "If you are here in the quarantine likeeee", "balaclava", "This song has one problem . . . . It ends !!!!!", "Unkanow: \nStatus by WhatsApp My friends 15 years:      XD", "would this song be nice for a 15 dance ? ", "Watch New music video by Dj Shake", "Any one  from India hit like 🇮🇳🇮🇳", "And thats why Rammstein deactivated the Comment function.", "Do you guys have any ideas or any apps can make the photo still looks clearly when you zoom the photo ? Because when you zoom a picitrez the picture will become blur, can you teach me please", "Version original snow informen", "Who here with me October 2019", "This is what I'm talking about", "pressed like before listening. Cause it's Khalid, or course.", "We all kno in 2020 yeezus is a masterpiece", "Despacito", "Paulo Londra the king🥳", "Deutschland ist uber alles as this video", "she lost alot of weight what happened to the skin on her bones liked her better in la tortura", "Just dance anyone?", "Tell me this track dont need a chingona ranchera", "Bad bunny parece Avatar", "0% Nudity\n0% Obscenity\n100% Relevance\n100% Educational\nHighly recommended", "BRUH Why is the spamming happening again", "Is that Miniminter's girl?", "the instrumental makes me think of an old dancefloor song that was poppin back in 2000 or something , do someone remember the name ? help pls", "https://youtu.be/qoxMJTVLaCo Heaven to Hell Remix 👑", "“Don’t cry because he died.” “Smile because he was born.”  Copied", "the king is back", "Less than 790 left for 2M likes woohoo 💜💜💜\n\namazing it's finally 2M now, the only kpop group to do so with 2 Mvs. am proud 💜💜💜", "Kimberly have her own style!!!!! KIMBERLY ROCKS!!! PCD ROCKS!!!!!", "Marc Anthony is ny friends cousins cousin so my friend kinda knows him but did not see him", "Everyone's thoughts in this song: DID THIS NIGGA JUST SPEAK SPANISH?", "I have a lot to say what am gonna say is thank you so much", "Me during quarantine : *Pressing 4 on keyboard furiously*", "I'm dedicating this song to 2020. Goodbye and f off, you won't be missed.", "Lets get this to #1 on youtube!!", "Happy Birthday to our Jennie Kim", "This music is suicidal,\nit begins with faking you that it is convincing you not to kill yourself but the words and lyrics that he is rapping is telling you that there is no other way but a miserable lifestyle you might as well go ahead and make the jump. \n\nTo men if you put Jesus as your head everything will be alright.  no religion a friendship, love you.", "My mom did not know she treated us like dogs I forgive her for that,", "Does anyone have the impression that this song should last longer? It's like some parts are cut off from the version that should have been released in the first place...", "I have .001 million subscybers", "This song reminds me of so many memories of when I was younger, when I was little my aunt used to play this song for me and used to call me her \"Waka Waka\" 1 year later she died this song is all I have left of her", "I saw Antonie Griezzman in this video", "Yes ! This brought me back to my high school days!!!! KILLED IT 🙌🏼", "Do Spanish rappers fall off bruh", "Mane rip pop smoke", "This gives me on my block vibes", "@sortaLikeCheddar119 Lol Cry moar. Idiot.", "GAGA'S BACK ON HER SHIT OMLAOIFDSHAO BITCH WE LIKE AHHHH!", "Been bumping this one since the snippets ! 🔥", "dis shit hits hard after a breakup nlg", "This will be on repeat for years", "Love xxxtenatacion the legend", "#MakeGangnamStyleGreatAgain  2,906,396,387 views", "Marina had a striking resemblance to Mother Gothel in her red outfit. o.0", "The only french words i know is hola me gusta", "Watch my new video \nhttps://youtu.be/03PAtqgBKJA\nIf u like subscribe.\nNice song if u like the song then watch my video too and subscribe😘🙏🙏🙏🙏💋💋💋🐴", "Come on blackpink", "reminds of Total War games: when your unit is routing and the enemy has hidden archer units", "No. 1 Trending in the Philippines ❤ .", "This song EASILY get's 5 stars (:\n\nHaiti, you have my prayers.", "Can we reach 800m before June comeback??? \nLet's do it. Fighting!", "1:25 Where is it? Pls coordinates if possible", "sorry for dislike, i didn t see that", "@xXxHyperBunnyxXx Fit as f**k :)", "the is my new favorite break up love song.", "i dont understand how there is a dislike button for this sonq!!\n\ni cant get enough\n\n<3 eres vino tinto mi trago predilecto!", "REMIX CON OZUNA NICKY JAM", "Who is waiting for 400milion views ? 😻", "nobody else gonna talk about how he looked like billie eilish in the thumbnail? no? okay", "And yours is any better?  ", "Maluma is so hot😍", "When you love your country but hate it at the same time for the atrocities it committed.", "Lets get mic drop to 600M...!", "this song is not long enough ! repeat button freaking out", "no", "*_Just an oficial English comment_*", "I think that it's such a genuine love song because it's so awkwardly funny \n\"My taste in music is your face!\"\nBut also so emotional\n\"Sometimes you have to bleed to know that you're alive and have a soul\"\nI think we need more realistic love songs like this XD", "Verizon commercial.", "Part of the piano verse is totally stolen from Fiona Apple.", "He is an angle\nI purple you jimin💜", "This is VEVO not K pop anymore", "My fantasy hotter than Miami😍", "shes the tear in my heart im on FIRE.... HELP IM ON FIRE", "he has 2 left feet  or is that a saying IDK", "OK now I am ready for the second lockdown", "Fast and furious puerto rico", "sorry songs", "waiting for that 1 BILLION views", "I miss mexico", "#10 in Taiwan! Let's make it to #1!", "When he says \"who r u?\" i always say my name \"Bella\" lmao", "Bop= like\nFlop= comment", "courage", "Check lyrics with English meanings here:https://m.youtube.com/watch?v=oHg5SJYRHA0", "Can someone translate dis song to English", "She sound so black on 2:34- 2:42 😍😍😍😍", "Low. If you're trying to insult me, try harder. \nYou obviously haven't heard GaGa sing live. You're ignorant and opinionated, so let's be honest: your opinion doesn't matter. Goodbye, take care. Don't write back, cause I don't care. Oh, that rhymed. ", "2017 and still listening to this song", "anyone else hear wamkelekile ?", "*me sees Trash on floor* \n*YEETS* oof i miss \nMe LOVE EARTH 🌍", "this video gives me gta san andreas vibes", "6ix9ine be like : tice nits", "Hes not dead he just got welcomed to another party", "@ControversialToon wow lmfao now i cant stop laughing when i see this i was drinking water and it came up my nose! ", "Another comment but i don't know what to say anymore", "watch dogs everywhere", "Who want bed like that", "Otro hit the Marc Anthony", "I'm here again", "did you know jose was gay?  they called him jose fellationo", "This song has every females pantys wet right now", "go", "SHUT UP THIS OUTFIT IS EVERYTHING", "Which language is the song in?", "As fans, all we can do is prove that we need them as group, and they are worth a lot to us anytime  So keep supporting Red Velvet. And little remainder from me don't get along with negative respons out there, just ignore the bad thing and focusing on bad boy MV 😆", "It went from,\nFinding someone you like,\nThen getting heart broken,\nAnd finally wining their heart,\nUntil they shattered you to pieces again😭😭", "Best Ed Sheeran's song", "Marc Anthony!!!!!!!! So good!", "I love this song, not because of my spanish teaher, but rather because Juanes is one of the most talented singers I know.\nGod bless you, Juanes.", "LOL THIS IS MY JAM xD IDK JK OR NOT xD okay boy or girls XD  not", "*WE DID IT*", "the remix comes with Bad Bunny, Ozuna, Anuel and Daddy Yankee. \n#LaNuevaReligion #ElNegritoDeOjosClaros #RHLM #DY", "I like the dress the fashion it's so very native love it I hope I can buy", "I'm just wondering why this song hasn't got 100millions of views ????!!!!!!♥♥", "‏You will never be happy if you continue to hold on to the things that make you sad", "porn", "Before 1 million", "HATERS GON' HATE \nPLAYERS GON' PLAY \nLIVE A LIFE, MAN \nGOODLUCK", "yeah i know same here...\nat first i was confused :D\nbut then \nELLE ME DIT", "here’s the English comment you’ve all been looking for :)", "probably the only opera i'll ever listen to <3", "I want a behind the scene version", "This song made me to live like a Champion...", "Hi can you please come to Arizona", "B-army", "How tf is there comments from like two days ago", "Listen on speed:1.25x Its Really Cooool :)", "English please🤕", "Wait, so Jungook is the dark-hoodied figure?\nLook at 4:39", "I like it and I will hear this forever \nWaaaaa re capa in inglish", "Me^_^\nFirst time : Ok\nNth time : famili famili famili familiar", "Where my fellow English speaking people at?", "i want that cookie...:)", "KIM NAMJOON", "No one will talk about frank vocals on this?", "Sex sex sex boom boom \nFrom morocco", "Who is the lucky guy that gets to be in these music videos though!? I’m not even LGBT but I’m still lowkey jealous😂💖💖💖", "Keep watching once", "RIP XXX LEGEND NEVER DIED", "_I won't give up to meet all of you too , Angel ! _*_Even I'm die , its you_*_ . My _*_Paradise_*_ --_", "@miss5ak If this joint did not make you spell right, theres something seriously wrong with YOU.", "MOMO WITHOUT BANGS OMGMDMSMAMAMNXNFNCNFNDKD", "that looks more like brazil", "do we actually need it??", "The pink guys from the back of the pink car looks like the red guy from don't hug me I'm scared", "Anyone 23 may?", "The king 🔥", "a.a \n\n\n\n\nxhghg", "Fight! Fight! Fight!  I won't sleep until its 90M!!", "0:01 and 0:08 is that halsey", "Okay but he came for Jim Carrey 😂", "I used to think she was saying \"Ima need me a redbull\" ", "This is the time to show our support to Blackpink with vote in MUBEAT right now!!!!", "I used to listen to that  back in 2011 ans still listening to it in quarantine. 12/05/20", "I.25* play back speed woh amazing", "Before despacito became a thing...", "I came from instagram 🙌", "Me: I only listen to songs with deep and meaningful lyrics 😒\nJimin: mI cAsA\nMe: *crying* omg what an intellectual", "I bet arod even bumps this.", "@Jessica Quiroga I dedicate you this song! I love you friend and more than a friend!! jajaj", "Ice top", "At 2:20 I heard a fart. 😟", "Proove that im here before 1million views", "thunder in paradise", "was so glad to see  a sámi joiker ;; honestly that's so important", "here we go 10M", "Teacher : Roll no. 21\nStudent : Say my name \nTeacher : Get out of my class \n\n\n\n\n\n\n\n\nHave a good day 😊", "\"Baby you should enjoy yourself\" best part\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n0:25", "The steps are full on bollywood", "does lisa's lyric is refers to gd's black?", "2:56. Is That G-Dragon?!", "Have you noticed guys Jennie's sock /boots changed color from white to black 🤔🤔🤔", "Let's go blink let's stream this", "Yay for the Latino McLovin!", "Yesssssss I've been waiting for this and its taki  taki", "Help America be great again, for you and your family. TRUMP 2016!!", "@Is_emeka instagram", "name music please?", "Jimin \"I could see the sunshine shine...\" \nMe \"JIIIIHOOOOO...PE\"", "But I am waiting for \"South Of The Border\" music video.......", "@sortaLikeCheddar119 You're still on this didn't I get rid of your trolling ass already?", "*LETS MASS STR3AM GUYS BECAUSE WE DID NOT REACHED 1M TODAY WE SHOULD ALL WORK HARDER FOR ITZY!!!! Please cooperate MIDZY’s tell your friends or the best even fandoms FIGHTING MIDZY’S DONT BE LAZY!!!!*", "I NEED A MUSIC VIDEO OF THIS SHIT NOW", "hey guys the \n2nd part of your love² is jungkook's part not jimin and also the la la la love it's jungkooks part", "befhbhswvdgsg the part where he raps slower when he's attached and flames are surrounding him OMFGG", "JUST KEEP STR34MING ARMYSSS", "2020 anyone ???", "wasssup with the vampire teeth", "liked the porn version more", "I don't love know about it the", "why people comment on dislikes, some people like or dislike songs, plus it might of been their first time hearing this so how did they know they weren't going to dislike it. just because they dislike doesn't mean they watch it over and over again.", "Does anyone else think this sounds like the clash's should i stay or should i go? cause i'm getting mad vibes", "the *only* English comment", "is 0:29 to 0:31 an error?", "The alien is saying show me your thingy", "If you like this song give me a Like", "What It Really Means : I Like It", "IM EARLY YES!!!!!!!", "Who came from Fortnite😂", "Who y’all think meek talking bout?", "I was suppose to dane to this song at out wedding but we ended up dancing to hearts dont break around here and kiss me", "It reminds me of great time in Barcelona and makes me wanna go there ❤❤❤ BARCELONA! The most beautiful place in the whole world ❤❤❤", "Str3am dynamite", "@xXd4k1n6Xx  Money talks lol", "Who is she????????????????", "@67DrWatson Hahaha The Beatles!? ... only good in the 60's as people didnt know any better LOL. Rubbish now....", "#9 on trending in Ireland", "THIS VIDEOCLIP IM WANT TO SEE ON MY TV TOMOROW MORNING 9.30 ON MY FAVORITE CHANNEL MOOZ  HITS PLEASE EMIL", "as a hispanic, i wonder how white people hear this ???? like ??? is it the same as us hispanics orrr", "I want my crush to play this song for me so badly :'(", "when you know spanish and know how porn the lyrics are..", "*\"Rosé are Red\"*\n          *\"Violet are blue\"*\n*\"As long as BLACKPINK upload\"*\n          *\"They gets a view\"*\n🔹\n🔹\n🔹", "If y'all knew what this dude just said to me 💜", "every army student who stream on their exam day:\n\n\"Please give me a remedy~\"", "I'm like Blue & Grey", "nobody:\nmy online history lesson: so, you gonna do this or wha-\nme: BRUH I VIBING LEAVE ME ALONE BISH", "I wish i were a female rebel ", "He is so awkward at the beginning", "Boy's watch this Billions times.😂😂😂😂😂😂😂😂😂😂😂", "Like for the jdm culture 🔰", "@MagiX19 gay ur gay ", "I'm more than your lover, I'm your friend...", "ACHIEVEMENT!", "Does anybody know what happened to nayer now or what is  she upto cause it been a very long  time or years??", "My dad knows this song as\" That song about potholes''", "Yariik babeii hes south korean. And the explosion was most likely not korea. But it is extremely sad.", "aye its ya boi checking in , peep my music and comment your feedback please , also like subscribe and share ,i'm fin to make a way into the game help a brother out by tuning into my tunes love yall signing out  ~ clutch handla", "U know the wiggles done this as well", "@Black24Thought They're football players", "this has only been out an hour and people are already doing reaction videos....people don't want to admit it, but they love the clout they get from mentioning 6ix9ine.  This man is making a lot of people money....the views are insane", "What the hell, they forgot the boats and hoes part of the song.", "Lil Dicky : I'm DJ Khalid, why I'm I yelling?\nChance the Rapper : He's a no brainer\nDJ Khalid : I'm the one yeah", "I love that flurry pinky moster behind 😍", "Papa frita is french fry", "January 2019..anyone watching?", "I took 2 years of French and I can't understand xD", "I'm the english comment you've been looking for.", "cant believe they sampled miley cyrus on this song..", "been on repeat for days 🔄", "Is it new Despacito ?", "By far the best song I played this for my uncle when he was dying in hospital love you uncle tony fly high sleep tight x", "BOATS AND HOES", "BTS fighting 💜...I have no words to describe how proud am I to be an army and being at the same generation as you. ARMYs fighting 💜", "Selena's so humble, I'd totally sing \"Diamonds on my wrist so he call me ice QUEEN\"", "why is romeo like wine ?? god damn", "Another one (video)", "I watched this when my squad and another squad is about to make a war at roblox c:", "And another one❤💋😚😍", "Dreamin' back to the week we where in Barcelona. I miss it. <3", "This will huge like DESPACITO🔥💪", "Thanks for bringing that Jackson power into our lives", "\nToday a cyberpunk leeched a new fuck video clip with the bitch Rihanna\nEnjoy the full thing here :\ndaily-celebrity-gossip.me.pn\nhahahha,this particular girl is really stupid", "Whats the name of the back round music???\n", "@chwdp08 like his parents are cuban @_@ K.Cool. ", "Im definitely duin a Remix to this🔥🔥🔥🔥", "442oons song was better", "We only need 100k views to Kill This Love reaches 800M\n5ting!!!\nAfter Kill this love reaches 800M, we will stream Stay or now", "Penis\n-chris romero", "MARK'S RAP\n\n\n\n\n\n\nthat's it, that's the comment", "Just here for Dev :D", "“We defeated the wrong enemy.\"  - Gen. George S. Patton", "loo", "Just a normal English comment here", "*TaeTae’s Crazy For My Myself is a crazy meme\nGoing on the internet lol\n\nTaehyung is my bias btw tsk.*", "I need to know the meaning of this album", "*English/or other people:* wow good Kanye.\n*Me, as a hungarian:* hehe 10 million forint go brrr", "I subscribe", "Perreo Old school !!", "#stream keep streaming and I have ice cream views to freeze", "Jesus bts has such a big fan base", "Vay be", "Does anyone notice one of the girls is Nayer from the song suavemente", "a rare occurrence, pitbull in a music video without girls in bikini's for 3 mins :D", "peace- check out this -B00K if ur into reeeal hiphop and cypress hill-- they got inntervievved in this..book right here--\n.\"'\"HOW,,;:TO;,:.RAP,\"'.\"\"\ni-bought it on-Amazon, tho i think itz in book-stores, as well", "How his alive", "i can tell they took this beat from cypher pt. 4", "She wont see this comment so i can say it here. I cry for you.\ni cant find a way out, i just see the door that leads to you but you'll just close it on me.\n", "1.25x speed makes a nice beach club chill vibe", "@drnena0593 It's ok. Not everybody has good taste in music, like I do ;) And what do latinos have to do with the quality of the music? Just proves my point that you don't know anything about music...", "Stream on spotify and apple music please 🙏", "I’m the English comment u were looking for", "like for J BALVIN", "@MysteryMeh no, they aren't on the flor!!!:DDD", "pretty sure they dude at 1:47 is wearing a pair of panties on his head...", "YESSSSS WE MADE IT", "and the looks too? :)", "He took an arrow to the knee", "I've now gotten into another fandom\n\n\n\n\nGod won't be able to help me this time :,)", "filipences 1:6", "Doesn't seems like he's bieber, maybe he's mark isiah", "isnt the chick dancing the one off from the music by the potbeleez?\n", "I see this video 2020", "Hey Jaeguchi can you please put Tae iPhone covers?", "Please check my channel, all I want is your guys' honest opinion. Thank you so much! X", "Vote for bts in the Grammy  last  day!¡!¿", "Bad bunny’s cousin just went crazy on this!!!\n\nhttps://soundcloud.com/wavami/bopstar-prod-jordan-band", "@DocAmericanEagle I don't care, they just can't comprehend the facts.", "MY WINNER 1!!1!!!!!!!!!1!!11!! FROM SERBIA", "Bad bunny", "Hello Person Scrolling Down The Comments. Enjoy Your Day Or Night. 😀👍", "This video is tuff yo. Can y’all subscribe to me please 😁", "#23 trending in sri lanka", "#Chill#CoronaVirus#DukiRIP", "Who gonna kiss my bonbon tonight", "@NeptuneSmoke I'm surprised you don't know Mika, he's very famous, in Europe at least! He's an English singer who, very surprisingly, normally sings in English.\n\n\nDe toute façon, CETTE CHANSON EST GÉNIAL!", "who can give me a tissue", "She got a loco voice...", "I WANNA LISTEN TO THIS SONG ON AN ANIME!", "I just saw that bts broke our record for only 17 hours! Congrats Armys! I'm really here because of V! Let's support each other!", "it’s been like 3 months since this was released & I’m still not over it", "Anybody else randomly trolling through YouTube...", "for me the intro mikrokosmos....sound like stockholm syndrome by 1D", "This feels like BTS and you are the only people left on earth.", "Marc Anthony was never in the Video ? \r\n\r\nI never though Marc Anthony would ever collaborate with Hip Hop music ...\r\n\r\nI see Willie Bobo's Son  Eric Bobo ", "Blackpink in your areaaa", "Kevin hart dance in the movie think like a man was more impressive", "I'm here because of a bad joke by Jon Richardson on 8 out of 10 Cats does Countdown.", "Wow! Give it a like before it reaches 7 millions", "2:00 thats JK singing", "Check the girl on second right @ 1:43 getting trained..", "12 years to live. Come on people save are earth. I don't want to die in 12 years. I don't think no one wants to die in 12 years . GOOD LUCK", "when meek put this snippet i say this homie will hope he drop this because this will blow the streets 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "me", "i cringe everytime he gets hit by an arrow", "ok  like", "All the boys at middle school wanting a girlfriend: \n\n\n\n😂\n\nNo offense boys.. LOL", "This Was Next To Mi Gente", "Europe future men))))", "Army let's get her into 200M", "THIS IS TR3NDING #39 IN MY COUNTRY!!!", "i googledit and found out that isn't even a country, reported as spam.", "Lol I was gonna comment why it only has 18m views then I saw the date it was released.\nHope this became a hit.", "_I'm loyal to Sope_\n_I'm loyal to Sope_\n_I'm loyal to Sope_ \n*I'm loyal to So-*", "Your Spanish! Wowhoooo! 🙌", "Everybody: he snitched\nSomebody: the milk in this video came from grass fed rats\nNobody: remembers treyway...🥴🤯", "I forget how young he really is sometimes, The beard look definitely ages him. He looks good with or without it tho 😍😍😍", "Someone just post the lyrics here so tht the views wont go to the lyric videos", "Its : just like I never thought I knew the song", "This shit hard", "Were almost 250 come on.", "Who cals this song?😂", "No one:\nLitterally no one:\nEveryone:commet this and gets nothing of like", "What’s up with the views what the hack 995k likes vs 456k views whattttttt", "It’s been 45mins with the same number of views no change what’s the hell ??? ARE YOU KIDDING MEEEEEE YOUTUBE", "I like psy's music but in reality this is more of Snoop dog- bhangover - Ft. Psy.", "100 million", "anuel + bad bunny 24 hours = 2m views\n6ix9ne ft nobody -  100m views in 24 hours", "Buss down when you get the buss down tun tun when I get the bus down", "I just got that 2pac vibe from him", "#18 trending in indonesia!!", "This is the English comment you've been looking for", "Yes I'm from pernara and I found you number and I can't stop calling you", "I become a blackpink fan because of PUBG. Now I listen to all their songs", "nobody can fight yt except army bcs we're army", "Baby turn around wanna see it, try to see it, gotta see it, wanna see that Bubble yam bam baram bam baram\nBubble yam bam baram bam baram", "Last year people said televoting should be banned because Netta won. This year is the jury to ban because Norway didn't win.... The winner is always the one who sums more point from jury and televote together. So, the winner is The Netherlands, although Norway had a great entry who deserved winning the televote.", "\"Where is my angel?\"\n\n\"I'm sorry, I can't be your angel. Maybe there will be someone later who will be by your side more than an angel. Because I can only see you, without dreaming that someday we will meet.\"", "was this just re-uploaded today for fun or....?", "I watched this song since I was 5", "I'm more than ur lover, I'm ur friend", "BLINKS KEEP STREAMING!!", "1 Billion Views....! Amazing Singing by My Favourite Singer ever Enrique Iglesias", "I love those deep south ladies😍", "Thumbs up if you watched this before one million views", "Daddy Yankee on 174th Street?? Must have caused quite a commotion.", "@powereater of course they don't want to be there, it's Africa", "I rap and sing too", "im gonna need to learn spanish after all these big hits", "Remix this for covid & it just might go #1", "@puroboriqua13  seriously.... i also want to know that !! lolzzzzzz\n", "Waers my PURTO RICAS AT?!?!?", "no other fans will help us    other companies have Family Fans", "700K LIKES FIGHTING!!!", "where is flo ridas fast rap?", "Hanblen  lo que quieran en este comment post yall talk about him getting virus and joke but yall joke on social media and everything and yall all scare hes been posting on Instagram fined so what yall got 🤔🤔🤔", "AS IF IT'S  YOUR LAST", "BLINKS I BELIEVE IN YOU GO GUYZZ", "Winners prediction (my opinion): Brasil,Germany,Italy,Spain,Netherland", "Taylor Swift house", "SOMETIMES YOU GOT A BLEEDING NOSE! That your alive and have a soul, but it takes someone to come around to show you how, SHES THE TEAR IN MY HEART! IM A LIME!\n\n\n\n\n\n\nYour Welcome :)", "Can we get 200 millions views by the end of the month?", "Im curious Why can't you in Germany??", "Please!, do a collab with james arthur❤❤❤", "BLACKPINK are now less than 997 MILLION str3@ms away from becoming the most streamed female group on Spotify.", "Only true ones will know from witch movie the video is inspired by", "39 mil", "Twitch.tv/Briks", "Who else came from snap😂", "White,black and Latino everything is more stronger when we do together!! #fucktrump 🖕🏼", "Ur shark has arrived", "@ruben24200 no wonder why every time i roll down my window i spell tacos n burritos", "#10 Trending in German ;D", "Momo & Tzuyu: from nobody to somebody \nSana & Jihyo: you make feel special \nDahyun: you make everything alright \nMe: I LOVE YOU TWICE", "I can do that opra thung!\n", "Well like this comment \nif you do u will get very good luck!!!!!!!!!!", "the chick in the video is Tyler's wife! she's gorgeous!", "I'm the english comment you were looking for....\n\nBTW anyone before 1B?", "if yall didnt see the interview with zane lowe, the womens voice at the end is his ex and like my heart cant handle", "Jennie living in my mind rent free", "Is it me or I'm just seeing like 3 yt accs putting spam comments ?HAHAHAHA where's your co-antis? Are they busy? Well I guess they like the song HAHAHAHA antis are litterally liking the song ksksks btw stop the fanwars already", "Who like Macarena? ))))", "not sure what it is but the video is not frame correctly. there something off about it. Ozuna is on on synced. lol", "I came here because of Rap monsters recommendation 😂 who else?", "I fell in love with the fu*kin in the moonlight. lol", "when your girl don't allow you to have any girls in your music video", "moon", "Wheres my Angel", "Plz vote for BLACKPINK on mama and stream hylt if our girl didn't attend mama  we still vote and stream don't give up blink", "Music Sucess Tiktok December 2020", "one year has passed 1.9 md\n A song on my birthday 19", "I'll go to Germany so you can get laid..🥂🕯🔗", "OMG SO DO I  HAHAHA WERE DO YOU LIVE THAT YOU HAVE TO LEARN FRENCH? CUZ I LIVE IN PARIS FRANCE. ", "At last found the song", "Bboom bboom is now at even views with bad boy!!! LETS STREAM HARDER", "I do have one question, why was she speaking french in a voice note to someone who doesn't speak it? that's my 2 am thoughts don't judge", "Why it stacks at 2:22??", "i came from fortnite", "Happy nagpanchami DJ snake.... It's your day", "let's get this to 300M reveluvs! :D", "That one English comment", "Came here bcoz of Super Junior 🙊", "There is still a lot of inconsistency in the votes in MAMA2017 I do not believe anything that less than 10% are votes of America, they are to sue the organizers for their total disrespect to those who vote day by day for our BTS children.", "@Mangoyle \r\nThe Lark\\Bird spreads it's wings", "Who’s here in 2020???", "AMAs votes closing today, don't forget to VOTE", "They look the sameee", "*DID HE SAMPLE girl from ipanema?*", "What they say?", "Oh man 2021 really? \nYoutube: *Y e s*", "1:31 bad bunny version boomer", "selena", "Who is better :\nLike: 6ix9ine\nComment: juice wrld", "https://uniquevideos2017.blogspot.com\nhttps://uniquevideos2017.blogspot.com\nFollow me Please🙏🙏💓", "Why??? 2909 view and 41505 like", "ONCE from HK\nTrending # 2 so far 60HRS\nOn fire, ONCE!", "Fake bad bunny", "Pitbull is a #smoothoperator! I make motorbike short videos and race reports heres my latest video on it's way to 500 thousand views. Looking for sound tracks for future videos if any up and coming hip hop artists wanna get in touch!", "FINALLY THE VIEWS HAS COUNTED", "WHY IS IT THAT EVERYTIME TYLER SAYS ANNYEONGHASEYO AT THE START I CAN HEAR BAEKHYUN SCREAMING THAT N THE BACK OF MY MIND", "NO ITS SEPTEMBER THE 18 DUDES", "0:06 this girl looks like michael jackson", "I can't get laid in Russia", "This is my channel", "Who's this Mexican.", "*The English comment you are looking for*", "How come this song ended first in televote and had so little views (Les than 15 mil on combined clips). Something just does not add up here...", "it's me or this song can be in Hunger Games?", "Your in Latin grami", "https://youtu.be/qXGkWDrNNls wow. Bn", "Kml all his songs are Stripp Club songs😂😂😂😂", "I came her to my Babbbbby Maluma,  let us make a baby maluma plss ? haha", "the thing is Does the colour matter? like seriously.  ", "It's 3rd April 2020 my Birthday... and I started with This Song...", "Lets see who is watching in November 2020", "All latest tyga songs is being around PUSSIES and asses", "Who else just came here to look at the 11 million likes", "Michael Jackson** If you're going to trash something, at least spell it correctly. :)", "Bad bunny", "Brazikl to MOROCCO thumbs up Moroccan girls and guys :D", "I think this song is in french.......actully my sister told me that 20.51", "How far are these skittled commercials gonna go?", "1:26 everyone looks at j-hope\nMe: woooo look behind him xd", "when u forgot the songs name so u searched \"Spanish song la la la\" 😂😂", "Who listen this on 20 septembre 🔥", "victor", "Who's the king , who's the bosss", "1 million views in 1 day?! Woahhhh", "50MILL BEFORE 24 HOURS WELL DONE BANGTAN AND ARMYS", "Save me who ?", "Everybody go to the disco!!", "I hope loren is ok with this!", "Now this MV already got 1B. Congrats..\nYou can see that, how many people loved blackpink", "ed i think  next artis is adele =D", "The English comment you've been looking for.\n\n\n\nNow keep scrolling GL finding another english comment!", "Fancy and Feel Special fighting for Song of the year.", "Lmfao dude looks like Squirtle from Pokemon with the red frame sunglasses on. Hahaha", "Philippine Azkals for 2018!!", "Permutation of a very old song.", "Wait, in the beginning do they say \"1 2 classy hoe\" XD", "i just watch this because of the man :D", "Let's do an experiment everybody like this", "My favorite part:\n\nI cant lose, no I cant lose\nCuz I cant leave it to youuuuuuu", "if you could put 999,999,9999 likes on it I would", "so he’s just there being all romantic and Aitch jumps in and goes ‘so so sexeh lemme tap it from the back so sexeh’", "copy from#chori chori by Arsh", "Omg this is mine and my wife song", "So some girls should just be cast out, and live a loveless life?", "OMGG MAKE OT RIGHT!", "Arms around you🙏", "Drake's Spanish is Not that Bad!\nI'm Surprised!😄", "I don't mind eating 5.0 there so dirty I want to", "This video gives me a Burning Man vibe!!", "@Chefvonalles You're just like the guys 30 years ago who thought that rap was just a fad.", "I’m here from mattia", "everyone has a different opinion :)", "*BTS Spotify:*\n\nDIMPLE — 97,7M\nMagic Shop — 97M\nSilver Spoon — 96.8M", "Salam alaikum, how is your participation possible pliiz", "Area 51 LOl WHAT IS THAT", "Private Video 18+\n http://hoDpDCcShG.mcdn.design/KCTYgaPNfb", "Lets go, fighting army", "Like a Bad Bunny", "Once, drunken me, fell asleep in a sauna spa. That was the worst hangover ever experienced by mankind.", "congratulation for wedding annuel", "2:43 who dat girl?", "Hi Im new to BTS , Is this their new song ?", "Grammys robbed BTS. If you are motivated, stream your ass off. BWL to 1B , who is with me?", "I'm so curious yeahhhhhhh!!!! It looks like shinee's museummmmmmmmm in sherlock.", "Anyone here for English comments..", "Pique I know you are here like my comment", "1:50 onwards,  is that \"Obama\" I hear?😕", "somebody knows the actress name!!!", "Anuel aa is the Spanish drake who else agrees", "Why do i see flags from countries that aren't even going to the world cup! \nCuba, Jamaica, Dominican Republic Venezuela Just to name a few!\nYes we are ONE but Its Stupid to see the cuban flag at least 7 times & see others that are actually going like twice! WTF Just like the 2022 world cup in Qatar.. When the hell has Qatar ever classified to a world cup? This world is Fucked up", "You are not innocent or perfect.\nHeavily connected now and I never forgot about you like you forgot about me. I love u. My world will never turn. My life is on pause for you", "You are crazy in the cold. hhhh", "Let's pass that bitch ... XD\n", "Humble young boy outta DC\nNow your takin shots at OKC", "99,861,765✔\n 138,235 more to go in 2 hrs, ARMYS GO GO", "tis but a scratch!", "algerians army with bts", "4.9 million views in 9 hours but only 10k comments? Some thing isn’t adding up lol", "@OjosDeAmor18 Its Meadow Soprano, Tony Soprano's daughter", "6 days ago i said we have 40M views to 1B\nNow its 30M only!!!😍😍😍😍😍\nI like the spirit. Go armys go!", "Plastic and rainbow", "So did we break Spring Day Record???? It's 9.5M YASSSS!!!!", "0:30\nam I the only one who hears “say I’m gonna poop to you”?\nyes? ok", "omg... 807k views in 6 hrs...", "I played this song so loud\nMy neighbors called the police \n\nPolice arrested my neighbors 😼👮‍♂️", "i listened to this at school (with headphones) and my teacher was like \"wHy ArE yOu DaNcInG\"", "@Eniiilorak nope im the 56260549th", "@katandphoebz thats 1 word, 'luv' is not a word.", "imagine breaking harrys heart this much", "What dose loca mean", "Where she's desperate?", "The teaser is #45 in Italy, I swear if this video gets to the top 10 here, it's gonna make history", "Only now the this song from gta v", "How do I get the English version", "Is it only me hearing “there’s the part of you in how I dream”? Anyone?", "checkout my channel for the the english translation", "Is this in espanol or Portuguese", "Here from Sarah baska", "Im the one that watch this in 2028", "Talk to me nice😂", "Remix con myke towers", "Stream for BTS and ARMY!!", "Hola bad bunny", "Is the girl working for sex?", "TURKEY army", "Who is she?", "Well well AronChupa you cant make of innocence i can see ya there dance with the others!1:42", "Notifications squad where are you?🙌🏿", "karol g", "Just realized that guy in the beginning is Fez from That 70s Show", "2020: People Come to hear this song\n2021: People Come to hear this song", "KJAHSJAHSKAH when this mv dropped 30 minutes late i-....i tried to sleep already but luckily i did not HAHAHAHAHAHA", "OMG Jungkook's English, he's a bias wrecker 😭❤", "This song is so good, it get to your 💓 as well as this video, it good work. Ozuna,  👍👍❤️🔥🔥🔥", "1:42 nugetts lol", "I bought the replay button ... \nNow I shared this for you guys !!!!\nTake it 0:00 , i used them for a million times because it is expensive !", "lightskin... where?", "111.9M 🔜 300M in 67 days to break blackpink's record which is 300M in 68 days", "For salvini", "I heard this on the radio", "Next valentine we will be together!", "@easybrake It turned into abs.", "what", "100.000.000 HAPPY 1 YEAR BLACKPINK !!!", "Who knew this song before tik tok", "Literally * No one *\n\n\nNot a single soul \n\n\nJikook at 0:58", "bro no more dream is a song from bts's earliest (2013) album 2 kool 4 skool and one of the songs name is NO MORE DREAM i mean cant be a coincidence", "My ex used to dance up to this beat.", "who listen this at 11 august 2017?", "I remember i was 1st comment", "way 2020!! music famous", "hi im dance this for school in im cherlader", "The part you're here for: 0:37 - 1:26", "Showed this to Donald Trump....\n\n\n\nHe is now Presidente Juan Manuel Hernandez Aguilar from rural Sonora, who owns the Taco Tower in the El Paso suburbs.", "New twist on the ice bucket challenge at the end there.", "DONT SLOW DOWN", "$1m profit", "Me remembering the first time I saw this like \n'Man that feels like ages ago. I didn't even know SK was a country back then😂'", "ARMYS DON'T CLOSE. WE CAN", "anyone else find out about this from rock band 3? O:", "Any one else here for the very first time  watching a video on the first day it’s published, hands up 🙌🏽 Lol 😊 Congratulations to us!", "I Don't l look Jin Sing ???", "Just and English bitch shoing g up randomly", "Stream this until 100M 🤩💅🏻", "Hi army fans like me can you send me some pics  of jimin in fb my name in fb is Dana renegado", "This starting word is like a indian word :- kute bachke", "pitbull why not use belt", "Am I the only one who found what jopping mean?... 😶", "In soundtrack of xxx3's movie,Right?", "*_C_* yka blyat .\nO *_h_* wa *_i_* t now you're reading this comme *_n_* t?\n*_e_* xcu *_s e_* me then\n*_C_* uz I'm so sorry for t *_h a_* t russ *_i_* an cu *_r_* sive word.\nStill reading this?\nOk.\nHey , did you know that new meme already?\nRead the bold letters together.\nAyy lmao.", "That's Pitbulls style not Flo rida's ", "Just another comment passing by :)", "PLEASE VOTE TWICE IN MAMA Y'ALL", "Please vote blackpink #MAMA2018", "Who is better???\nBad bunny : like \nDrake : comment", "Can anyone tell me how does her accent feel, I mean I'm from Colombia, which is where she comes from and english is my second language so I can't feel her accent when she sings in english, can anyone help me with my doubt? ", "Bad Boy-50M\nPeek-A-Boo-60M\nRed Flavor-70M\nOnly RV can do this 😂", "@mw3navyclan why are you talking abt mw3 its music video not a game review \r\n", "how u gunna do color coded and get it wrong lmao", "YouTube always freezes the views..I'm not surprised at all...just look at the likes", "The song at the beginning is La La :) the other song is Danse :)", "Damn I don’t speak Spanish and I know what he trying to say, his momma didn’t want him", "WHY THE VI3WS IS SO SLOW", "oh hes practising his French before his GCSE's", "*DID HE SAMPLE girl from ipanema?*", "Just me or does she look like Cheryl blossom", "Really, Bighit?", "Well time to make myself pretty again and get a toy boy lol older ones nothing but trouble Xx", "Hahaha around 4:20ish u see her heels change into smaller ones !!! ", "People please like my comment \nI am desperate", "I don't getting the same question but I'm sure you can get a job", "cd", "The intro sounds like save me", "I am from indonesia and i'm still listening this music 😅", "Lets get this to 200M views", "Less than 200k to go", "Mami got an ass like a donkey, with a monkey\nLook like King Kong, welcome to the crib :d :d", "True story this is the only copy of recorded history", "Shit I thought it was a boy!", "420?!? million views", "despacito, I don't know the words so I say doritos", "army lets get this mv to 11 million views today but don't forget to make boy with luv  reach 424 million by tomorrow please", "Bad bunny aby", "The Prince of Latino on Top! Alex Molla DJ", "See you later in Russia 2018 ;)", "Towards the end*", "Namjoon is like guardian angel of bts 💜", "Copy LMFAO \nyoutube.com/watch?v=KQ6zr6kCPj8&feature=plcp", "Girls %50 milk %100", "Blackpink in your area! We’re so near co-blinks!!!", "I think Lisa wants to kill me", "Don't forget IDOL Y'ALL! We need to get that 500M!", "Theirs something called porn😂", "Like if waiting feat with lilpump😌", "Why did cypress hill sang in spanish back then? Why they didn't do it for this?", "Hey army's let make the song 1billion hit let's go we can do it\nBefore Christmas !! Or before V's birthday!!", "DarkNubis\r\nit shouldn't be Leonardo DiCaprio, it should be David Attenborough  because hes more knowledgeable when it come to the earth", "If your name is first letter A, then like\n\n\nGuys subscribe to my channel please i want to get started", "YO THAT BED IS BIGGER THAN MY HOUSE BRUHH...", "Bad bunny he's look like pulse in rainbow six siege lol", "One day you'll realize I'm more than your lover, I'm your friend.......yesterday, today, forever💜💜💜", "Im From Memphis and Just Dropped My Debut Mixtape ☔️ Features from NLE Choppa, Big Boogie and more 🔥 Tune in 📌🖤☔️ \nhttps://distrokid.com/hyperfollow/taitrendin/the-tape-2", "and not a single mention to the original song", "*collaboration with YO YO HONEY SINGH*", "I am here", "Viewing comments while watching the mv has a fun of its own", "who’s here after level of concern", "RIP to the goat", "boom boom", "Here's the English comment you're looking for", "This year if or if we reach 1billion😤", "Snoop is tall wow", "When r they gonna have a full length album 😩💘💘💘", "I didn't know what the song was called for 8 years 😳", "Producent : How many girls do you want?\nMaluma: Yas.", "I am a TRUE gangster and TRUE to my hood", "working for it", "0% malas palabras\n100% everybody go to the discotek", "*Dear stranger whoever reads this:*\n.\n.\n👇\n*God bless you and stay safe. You are a smart and awesome person.*", "This sounds like a song you'd hear from a car that's passing by", "woah im early (6 hours)", "sword in my hand, i fight like this\n", "Dalla Dalla- Breaking Backs\nIcy- Breaking Necks\nWannabe- Breaking Shoulders\nNot shy- Breaking knees\nNext- Breaking Records", "Dominican Republic and Haiti (Brothers and Sisters)", "They kissed💏", "Red velvet they copy the blink on \nPlaying with fire bigg yuukkk 😂😂😂😝😝😝😝😝😏😏😏😏", "has anyone ever heard T-Pains voice with out the use of computers?", "I hope they'll post the dance practice video when the MV v13w number hits 10M.", "This shit gets me high mate", "Felipes not ur dad", "5 mil on YouTube in 6 months\n\n\n\n\nMe on pewdiepie tuber simulator changing the time: cute", "No one :\nLitterally no one:\nLisa:Blackpink in your area", "Song : Spanish \nComments : English \nPhone : Chinese\nMe : Indian\nHotel : Trivago", "Who is here after Netflix...", "do u want some fkn cocaine", "His name in English is Dick Church.", "0:01 me when im in puberty", "Only a thousand more for 151M!!", "Just curious why Sarah lean on him when he is singing", "i am ready for all these songs \n*sees dream glow*\nim sorry i ordered a tub of holy water with jungkooKs ENLGISH  vocals and dont frogot some of that jin HIGHS also alot of that chill summoning vioce jimin and seal it with that charlie vibe\nhow will i live for the other songs FUNERAL READY", "Bad bunny Ft. Major Lazer & Daft Punk", "New song", "Fake love :500m\nIdol:500m\nDNA:700m", "Who else is only here cuz of SnapChat?? 😂😂", "STR3@MING PARTY FOR THE WHOLE DAY TODAY!! EVERYONE STR3@M HARD", "i dont think so, look at a picture of marc anthony and then look at the video again, its not him", "Ooh-la-la", "1:19 girl name?", "can someone translate the spanish lyrics to english please....", "who is she? what is it called?", "01:53 I think you're here for this!", "Ay yo who’s listening in 2020", "FIGHTING", "guys cmon lets work 22M is too little!", "Dear BLACKPINK, we are waiting for you in Russia!!!", "This is my LSS rn\n\n-mani mani-", "hello. let see if this get thousand likes😂", "If we did love the Earth we would be taking care of it!!!", "0_o 2:25 - she got her some... fuckiiin hell :D bet she passed away after that hit ", "look up this \"3 Lil Putos Drums!!!\"", "Yes you are !!", "Vegans are screaming right now", "who needs porn when you have pitbull songs", "how did no1 know him before im a celeb......he was like no.1 ?", "when your early and u dont know what to say", "1.9 comments? And there goes the chance...", "Jeremih looks like my gta character", "all the album songs are writed for louis, duh", "The only french words i know is hola me gusta", "Cool man watching it right now", "Nearly 82M fighting midzy", "very  papular song in pakistan.", "thanks to youtube now you can show the comment somebody answered to ^^", "Infinity ink-infinity WTF", "krippy kush", "0:06 I thought the man on the left was Conor McGregor", "4:05 ed is so fasinated", "Wtf does this have to do with Ecuador xd", "Bad Bunny ft. Daft Punk", "Bad bunny demostrate to be bad", "And english people here", "This gives me eurovision vibes 🤔🤔", "Need for speed:covid 19", "ON \"MV\":159M-200M\r\nBlack swan:121M-200M\r\nStay gold:63M-100M\r\nDaechwita:102-150M\r\nBoy with luv:841M-900M\r\nEpiphany:59M-100M\r\nMic drop:691M-700M\r\nIdol:694M-700M\r\nFire(1thek) :654M-700M\r\nDope(1thek) :575M-600M\r\nBlood sweat & tears:598M-600M\r\nLet's go Army <3", "is he gay or something .", "may 2019.......????????", "9.6 million views, are you serious Youtube? why views so slow to increase?", "Here for J Balvin", "When your homie Edgar finally makes it big", "What the baby dogs means at the end?", "0:14 JISOO BLACKPINK IN YOUR AREA OMG", "joe rogan alex jones", "WOW shes as skinny as my fat cock! LOL!", "Who listens this song 2018 in here.....?", "they doe be lookin like animations", "don't forget to watch running man on 18th!\ndec. 26 - SBS GAYO DAEJUN .\ncollaborations with other groups might happen\nBLACKPINK X TWICE X RED VELVET", "Welcome to me because I am new once in 2021", "hey", "Damn who dat boi", "100m views will come lol", "@themarsvoltaire \n\nPretty nice to see peoples in here, they're using their brains :)\n\n*thumbs up*", "If you're here from the dancing TikTok, the \"When a good thing goes bad\" part is Drake's \"Doing it Wrong.\"", "Eh what was on the painting tho fr", "Somebody tell me what dat nigga said last , seemed like he got off 😂", "this is how u burned haters and antis.", "Bad bunny", "Heard  this sing at Calibash for the first time 😍❤️🎶", "Mr ankeey new song", "Ice Cream Chillin' Chillin'", "Sound like JTimberlake in his past  young year", "after befikare", "subscribe Jennie s yotube channel please", "Just an english comment coming through...", "Why all these german comments", "@AlbuAlexandru1 no, not really\r\n", "Thumbs Up If Your Finnish", "This is how many people listening in 2020\n👇👇👇 #Demfings", "We can do it Army!", "14 october any?????", "Someone remind me what old movie I know this from, please!", "We should make this reach 1 Billion too", "BAD OBAMA bring me to this XD", "looks weird in 2:40 ", "5 YEARS THIS SONG", "This show remind me of the movie The Mask", "same melody as Destination Unknown :D", "Guys our rate is slowing down...", "It takes a real man to be this comfortable in his own skin to do this", "I probably added 1 million views to the count :)", "Honestly, every time I take MDMA this cowboy shows up shouting at me in foreign", "Nick finally got RED DRESS!!!", "wat just happened?!", "New single from \"Happy Sadnite\". . . KARMA. Stay in tune for official release. CHECK IT OUT! \nhttps://www.instagram.com/p/BWOnWNNHJOi/", "who is here while streaming Dynamite?!?!?", "update the view pleaseeeeeeeeeee", "It's my first time here!!!", "its dancing frog?", "type in \"Kicka_Woman\" and Enjoy ", "Guys I'm kinda new to BTS and even more to twitter so could you please guide me so as to how I vote for BTS at BBMAs", "Qbik- Taka dama to same background music", "From turkey", "Why is there soo many American flags ,they never made soo much in football or how they like too call it soccer!", "It shud say come and get ur vodka , hehe mintage ;) x", "I am poor one like = 1 dollar", "any english speakers around? :D\n", "Its medieval from the sopranos! !!", "Damn he was the 50 cent of this generation. The only difference is 50 survived his shots", "Why this sound like an Hindi song?", "Mayores vs.  Despacito\n(like).              (comment)\n(let's see which song wins)", "Producers:How much thots you want\n\nTYGA:Yes Yes make it hot", "you should look at the views", "turkhish army", "Beforeee 1BILLION?!!", "every day I listen to this music", "He’s such a wanna be daddy yankee", "the save me synth got me off guard. they decided to use it again. Jungkook looks like Amber to me tho hahaha", "I like it if you noticed that Bad Bunny was not wearing his glasses ...", "This is the English comment you've been searching for", "@linkinway he is that guy singin' the chorus line", "Dance in The Dark ♪♪", "Why are these reggeaton artists going so deep with the pot head look?", "I used to be an adventurer like you...", "I think the part at 2:21 is jungkook?", "Stack them up like legos...", "My crush was singing this in the past few days and we are only young were like nine well he is ten I'm nine", "I swear that’s. Me and my mom", "The Spanish version has almost 500 million views!!! Time to learn some Spanish????", "@terryconnerQ  grab it on ur face creep why u talkin about phones when u dont know how 2 spell it and ur listening 2 a song whats ur prob!", "*Everybody pray for new zealand muslim* 🙏😣😢", "Here before 1 million views!", "Did I rewatch this video myself because Lee know being bts back dancer ?", "Me encanta la cansino nicky\ni think all the upcoming singers are buying youtube views from *A U T H E N T I C HITS D O T C O M*", "The mexican scatman (not being racist okay so please dont)", "did YouTube stop counting?\n", "I want to know the meaning of this song anyone can help me", "youtube should make a chat session so while blinks stream we can just chat one another hahaha", "@DAIHATSUMEMBER   Drink of champions", "1 year.❤", "King slayer or kings layer", "Sorry. I found the translation. OOPS!", "My guess is 99.9 percent of the population has never heard this song", "Take it take it", "Keep stream for 700jt view", "Ohhhh I can make it right", "@078metalsludge321 i dont know if you are aware of this, but Juanes actually grew up playing metal and Metallica (on his guitar).  ", "Isn't that other guy, from the \"That 70's show? Lol", "Producers: how many celebs you want to collaborate with?\nDj Snake: each and everyone ;-p", "Anyone here from 8 out of 10?", "guys two days left before shorty awards close voting. army vote for bts !!", "Check out my Say My Name remix🔥", "THE NORTH REMEMBERS", "how did this come out 6 years ago-", "Whoa, is that Snow? Like, from the early 90's? I remember that guy!", "check my music out im 15 from cali it would make my day thanks for your time!", "Salvation", "Why so many dislikes?", "Dude this is so much like calabria. If the singer didn't die shortly after that song was realised she would so sue.", "Back to the SCHOOL", "His hair grows mad fast", "Who else here cause it was taken off Spotify?", "How does this vid have 6.8 billion im pretty sure that like 3 billion people on earth dont have youtube", "a.c.e chan brought me here 🥺", "Bad bunny", "I can afford to buy parts for my civic if it breaks", "I remember when de comments section was normal not a calendar", "Finily i see the song", "bad girls\nhttps://www.youtube.com/watch?v=ZXpx4DpyOBc", "10 million more for 1 BILLION \nLet's get it ARMY !", "TURKISH ARMY", "142.948...m \nAlmost 143M wow fighting..", "!i lumflc!", "Like if you're ... shut up", "macklamore getting down and getting in the mix XD", "who listens to October 2017 ????", "1M today", "where the fuck chaos2stone in this comment section", "wht da f? \n24K only watched", "Don't matter ... she says me ;) !", "I can speak Spanish so I'm fine 😂", "Cann we get 200 million views in two months lets take the top spot then get Rose Jisso and Lisa up there too.", "Bangtantv \nLike=people", "Soon 1 billion!!!! We can do it!!!!", "I can’t believe no one came from 2k...", "who else came back to watch their other videos because they just watched \"how you like that\"?", "Hey! I'm taking to you please stream BE", "You can find the uncensored version in Vimео", "Guys I just released a song on my channel please go check it out and give it a like thank you🙏🏽🙏🏽💯 https://youtu.be/dsYeitgGSeQ", "Maze runner who? \nI only know bts", "I wonder how Sebastian Lleget felt about this kiss???🤔🤔🤔", "is this calabria?", "follow my music , mex.", "lmao whose here’s after seeing the reference with taehyung in the mv for ‘ON’", "God this is old \nAnd I'm still listening to it.", "First despacito what next?", "6:40 i think you know why i put this link here", "Vejam o meu som novo pls aqui no yt ou no https://soundcloud.com/tiago-nery-3 // listen to my new song plsss here on YouTube or on soundcloud", "it's like save me, fire and puma's advertising", "Bad bunny", "I feel bad for his microphone stand.", "This is our Lil Meow Meow everyone", "Partying is fine...but who wants to be single all their life? Only living for one night stands.  You'll get sick of it, and once your liver gives up, and you die... Then you'll be forgotten in a matter of weeks...", "Blink pls search gg the right way to stream the mv pls", "the reason of  death is liam\"s smile at the end....\nnow feeling like nobody liked his smile ??", "I’m here before 1 Million views", "Whp is here in November 2019??????", "THE OFFICIAL INSTRUMENTAL IS CALABRIA  FIRE BEATZ REMIX", "I wonder how Christophs did that doggy style in the front of camera 😂", "my brain is right now at a farm,with sheeps and goats trying to figure out what he just heard..I’ll let you know when he comes back", "Te amor", "EVERYBODYY KNOWS THISSS RIGHT HERE!!!! YEAHHHH! ", "12M Within 24 hours, FIGHTING ARMY!!!", "BOI WHAT HISPAIC DOESNT KNOW THIS SONG", "New meme game waddup", "Go follow my Instagram 👉🏼Twin1983 I'm giving away free gift cards to Wal Mart for black friday", "let's see how many armys are listening to this bop on quarantine times", "Darling come inside *youdont want to hear this*", "Goblin Slayer opening for season 2.\nMake it happen", "*NEXT GOAL:100M in next 24 hours (in first 48 hours) who's with me?*", "Lets go", "this song takes me back to study hall this one chick was bumpin this and Scraping her pipe for resin. lol", "\"The songs on the radio are okay, but my taste in music is yOUR FACE\" \n\nsmooth", "Don’t mind me.. the only person that speaks English..", "20 likes and i'll make a cover", "Avril Lavinge I'm with you?", "i don’t know what these comments are saying but i know there positive 💯🔥", "anyone from india listen to Bad Bunny, Nengo, Farruo, Daddy etc", "Woohoo 100 million views", "KEEP GOING BLINKS! IGNORE THE SPAMMERS AND HATERS AND FOCUS ON STR3@MING AND ENJOYING THE FULL ALBUM!!", "*#5 trending in Turkey*", "flop or fuck", "este sech ._.", "a little dance movement is similar to the secret number which was the time to cover Boa No.1", "Can we hit 800M before they comeback?", "Coronavirus yeah yeah....", "Please don’t skip ads for this and when you are done watching it go watch On and Another MV then repeat the process", "\"I got married to this song\"\n\n\"He proposed to this song\" \n\nI have been supporting someone famous for a year and this song reminds me of them whoops😂💛", "me gusta", "5,453,113,228 views and only  3 billion people are now using the Internet", "LMAOOOOOO ..Pitbull says (Call me Michael Jackson, hi hi\n‘cause I love to play with MONKIES) lol", "People in comments who only speak English \n\n\n: English plz \n🤔", "Toyota Mark II !!!!!", "Health Points!", "Guys emoji don't affect views so keep str3am and let hater gonna hate, they are helping us :)", "God broke  his covenant and left the earth", "lowkey wanna see the dislikes hit 1M so we all know how much armpits are crying in losers dkdjdjjd", "Mass stream guys", "srigo Ramos The and Modrici RKO", "All   world must like  here  make   it  \nif  you  r  top  fan  of ur  state..\nplz  give   here  big  thumbs up....🌹🌹🌹🌹🌹🌹", "justin bieber watching this like damn i cant get enouph ;)", "Is there hd lyrics cuz I don't understand a fucking thing 😐😑", "This will always remind me of a mate who would rub cum on his chest and drive a red VB commodore.", "bolar kiso nai osther song nice", "I'm just saying this.. But hobiiiiii looks tall then most of them..\n\nEdit : thanks for the likes..", "why the spanish people look like they getting triggered lol", "more like in like 2-3 hours!", "PVP,:) germany wtf.", "Actually calabria is in italy.", "intro sounds like \"I'm with you\" from Avril Lavigne", "Who's here before 1,000,000,000 ?", "Sing a song named \"Pique is our Twitter King\" which includes se queda", "Im that English comment u search 4 hours", "can anyone who learned to speak spanish tell me about the programmes or the websites which helped 'em to learn please...XX", "What's he done with his hair??????", "Min yoongi! Slay my life!!! \nAll of them were fine as hell, \njin towards the end....deceased... \nMe and V gonna have to fight\nJimin.....no words\nJungkook stop coming for me\nNamjoon....daddy..\nJHOPE!!! Please stop bias wrecking, spare my soul....Im loyal to yoogi..", "BELLO BLINK!!", "@bad bunny", "Your bed is bigger than my house 😹", "Helpless shakira is now of gold", "Wow Khalid singing in spanish, you never stop surprising us", "Back in BLACK", "suscribe to my channel please", "Last time is was this early it was still Dalla dalla era❤️❤️", "We started with not even a feature in Hey Mama and now we here", "Fuckin a, the fact this drug is still considered illegal is as morally wrong as women not being able to vote and slavery being allowed. Time will show eventually within our lifetime this unjust and draconian law will change it has to, it is wrong! Prohibition for alcohol didn't work in the US, just like it isn't working now for recreational drugs.", "*EVERY SINGLE ARMY GIVE ALL OF YOUR STARS ASAP. IF YOU WAIT UNTIL THE LAST HOUR, THE WEBSITE MAY LAG. WE ARE LOSING. WE CAN DO IT EVERYONE!*", "@JoseDeLaGhetto1 now that's ignorance. other races does that too, not just black people", "WOW nice concept !! I am here for grow up together 👍", "look the videos of edumrworldwide", "Tiene algo de ritmo de travis scott , escuchen highest in the room , la intro", "oasis team !!!!", "why there are very less English comments???", "con esta melodia. tu color tu fantasia. con tu filosofia mi cabeza esta vacia.. lalala my partis when i was in spain..", "Diferente el video, love it. I so want to party now. Can’t wait for all this to be over. The vibe tho 💃🏻🔥even tho el nombre del tema no le entiendo mucho, like porque la tóxica?", "WHY MUST EVERYONE ALWAYS DIE", "Directioners where are you?", "what does albatraoz means?", "Let's make 500 million views", "Come back Grace Kelly...come back Lollipop...please...", "SUMMER WHERE ARE YOU", "https://youtu.be/Jc1CtVOUcg0 this song in meme version 😂😂😂😂😂😂😂😂", "9 years.....", "universal", "anyone know the name of the girl or where to get the \"paradise\" shirt?", "We want a clip for New Man 💕", "Im here before 1M views😊", "Idk how to feel about this", "Almost 1 billion viewers.\nAND A WHOPPING 2 MILLION LIKES.", "It sounded one of bruno mars' song...", "i don miss Kyle Jenner anymore", "There's one white guy in this whole music video and he looks like Macklemore  ...oh wait it fucking is Macklemore ", "Did you know ???? - ´Freshlyground have not received any royalties from the recording of Waka Waka and they have been told that 100 percent of the proceeds have gone via Fifa to the charity of Shakira’s choosing: One Goal. Freshlyground also performed free of charge at the World Cup`", "Are you serious", "*me* *encanta*", "Ete sech", "How come jlo don’t do more MAINSTREAM songs in Spanish? Perhaps it’s cause more Latina artists are on the rise and now all of the sudden she wants to show who Mami is huh lol.", "yes", "EVERYBODY GO TO THE DISCOTEKKKKK", "Fun fact: the east asians have smol diks and coronavirus", "Ok we get it you can make lots of videos.", "I do it doesn't go over well with the old lady, shuda left the rexa out and just called her bebe", "where the fuck was ed sheeran in the music video?", "200 Million !! Good job army", "Hi☺ can you have a look at my channel for a moment and let me know what you think about my covers ? I need your opinion and I also would like to receive some sugests for next covers. Thank you so much❣\n-ili.", "Shout out to messi 👌🏻", "593k likes and 483k views, yt is again drunk or Wat?", "Who is better?\n\nLike : *Lil Pump*\n\nComment : *Lil Peep*", "Strawberry \nCherry \nRaspberry \nHarry", "Am I The Only One Who Thought The Girl Looked Like Taylor Swift?? And Skrillex Flying The Chopper....", "Lets keep it road to 1b views army's", "nobody\nme : DiAmOnDs On My WrIsT sO hE cAlL mE iCe CrEaM", "It’s make this reach 1B views asap!", "@sophiec123xxx \n\nHer doctors fought the malaria , and i dont think having a divorce is something you should aspire to love, but saying that i'd love to give Cheryl a good feed of chips ", "Wow the girl in 1:47 looks a lot like SELENA GOMEZ  OMG 😱(plz tell me if you agree )", "Here before 1 million?", "this music video 99% milk und 1% ass", "He wants to ask me to accompany him at the Prom?!  I \" promise \"  I'll go with you. You should see my Prom outfit, I'm sure we will win ( Prom King and Queen ) Prom - ise.", "TaeHyung! His actions made me lose color quite a lot", "What’s the yellow jacket he’s wearing called", "Calls the song Vete, puts a Ferrari in there instead. These are not the same things, homie.", "Gold digger..", "2:07 ''solong, gay boys'' ", "Next is STOOPID like y'all who think that Tekashi is gonna drop anoter double E platinum title.", "Who else skipped to 1:23 😂🔥", "Right now it's the first time in the whole damn Sunday that the video gets almost 300 views in just one actualization... but let's keep watching", "I can't look at bad bunny the same way anymore after this vid", "@doncarlo568967 I would apologize for taking over your airwaves, but if you feel the same type of fun I am currently experience with this song, despite it being a different language, then I don't think I will say sorry after all. ", "pls tell me, is 1:34 Lisa's voice?", "Well I am a blink but nowadays l listening to army", "Respect Cypress Hill!Peace!", "FOLLOW ALL OF THEIR IG ACCOUNTS!!! SPECIALLY LISA HER ACCOUNT HAS THE LEAST FOLLOWERS!!! YOU CAN FOLLOW THEIR ACCOUNTS NOW!!!!", "Arabic army lets gooo... .", "IM EARLY", "joel", "hi, english comment here. who is bad bunny?", "Its been 2 years", "Ete sech", "Any body notice stills in the video ? Do u guys even know who he is, he’s one the members of Crosby stills and Nash that created the song cypress hill used and Mark Anthony is singing.", "Buenisima base", "Dj snake", "feeling some serious Fast & Furious vibes from both the mv/song", "boy", "when i was in elementary i was like that do anything to get with the girl ;) ", "Any from United States of uganda 🇺🇬🇺🇬hit a like👇💃💃", "namjoon said on the fancafe if we keep streaming IDOL he’ll release another teaser of RM2", "Who is watching in february 2017", "Producers: How many effects do you want ?\n\nTyga: Yes", "yaass army we got it to 1 billion...grt work guys!!!\nnow BWL and ON", "Thank you", "Ytbe malfunctioning, their algorithm going crazy, can't even handle this 7 deadly boys", "Ecuador vs darude sandstorm which is the best?", "Jin saying “hold my hand. To that future, let’s run away” and how after closing his eyes we are transported into the future where BTS is singing on the stage once again with the lights representing Armys. I don’t want to cry because life goes on and we will meet again.", "Spanish Music :x Holla from Romania ! :) :D", "@BlackCampariBlue UMADBRO?", "Muy bueno.....", "pitbull always finds the best lookin latinas. ", "Who that chick in the vid?", "I still remember when he beefed it with daddy Yankees he was a nobody. But look at him now", "lol ikr!!! xD i'm not the only one that understands that!", "Wait it's already #27!", "Where is Taehyung???", "Haven't it got likes?", "anyone from morocoo her 😀😍", "*DESPACITO 2 CONFIRMED*", "girl is lenggggggg", "LIKE SI AMAS ESTA CANCION \n\n\n\n\nSOY UN  YOUTUBER  CHICO POR FAVOR SI PUEDEN PASARSE  A MI ULTIMO VIDEO VIDEORACCION AL DEMENTE", "Keiino for 2020", "soy  tu  fan", "most of us cannot see the comments..\nmaybe we're not only broke youtube down, but also the network 😁😁😁", "its freezing😭", "1.040.827.198 views shitttt", "Germany r going to win the cup (y)", "Choreographer: \"How many dancers do you want in this music video?\"\n\n\nHobi: \"yes\"", "You have finally found A English comment congratulations 😂😂", "Shine, the rest of the stars are watching", "Que bueno", "Keep streaming, Blinks!\r\nIt's going to be harder now to increase our views since a lot of Blinks are sleeping but let's do our best!", "Wow only 1 minute and loads of views", "OMG play at speed 0.5 xD", "Top 5 Most Viewed Girl Group MVs\n\n1. Work from Home\n2. Worth It\n3. *DDU-DU DDU-DU*\n4. *BOOMBAYAH*\n5. *As If It’s Your Last*", "stream stream stream", "lets go baby", "nayeon feel special 6.4 go to 8M for he BIRTHDAY", "Remix, feat. Bad Bunny", "Who knows  this song from TikTok", "All world one country 2044", "Same guy who made chacarron", "The apocalypse is here", "Peep the dislikes😂", "so muchh", "Ah re", "Novo video oficial no canal Eurovision Song Contest\" Salvador Sobral (Portugal): My sister will do the first 2 rehearsals for me!'\"", "Who's here after the emas?", "just found out that the mv is a tribute to the deceased of the Sewol Ferry tragedy in April 16,2014", "*Stay tuned for BTS'S NEW SINGLE*\nOn August 21\n\nWe have to play it loud", "Anyone else who wants to live in this Earth without Corona virus?", "Fun fact: You're watching this in quarantine", "@Cl0udx3 sorry! it is you you yeh you and deja vu <3", "This really the official video?", "i'm here because benito forgot to end his concert with safaera", "I believe in Army’s power we can make 200m views in less than a week", "Ete sech", "I feel like they missed out on an opportunity to capitalize on how both Liam and J look alike, or rather...\n\n\n\nFAMILIAR!!!\n\n\nI'M SO SORRY!", "mi amor", "Jesus ! Our species are dying 😓 becoming more feminine.", "Mute for the ultimate experience!", "Those are lucky people who is here before 1M", "I'm that 800th million view.", "Never even considered listening to metal before this. Now im in a deep rabbit hole", "From india", "I came here for his hairs 😂", "me gusta", "SHAKING MY FAT ASS TO THE BEAT", "Is this sakira channel", "@TheSayso123 nice account name :P", "Respect to all the latin americans siiii \nEven 2 meh la mexicana haha :3", "nicky jam :)", "Bet most of the missing dads is there", "Llegue brother", "was this just re-uploaded today for fun or....?", "if you don't see this comment press like\n", "Spanish Music :x Holla from Romania ! :) :D", "the begining reminds me of Anne Clark \" sleeper in metropolis \"", "me gusta", "hey", "Can we just have normal comments and not compare other's😒😒", "Hala Madrid!!!!", "This guy is comedian not a rapper😂", "When the views are almost the entire human population", "I  heard this in zoo lights", "I Just have one think to say. Anitta is a singer of one hit in US. Downtown , she need change .", "carina", "Ete sech", "Who came here to see the most liked comment 😂😂", "God bless you!", "Bab bunny team nunca anual team", "sin ti", "I am BTS Army here to support Blink and Black Pink to get 100 M ... Fighting !!!", "Eh eh eh stop dat fightin lol child's grow some balls and be nice to each other", "I came here from  snapchat tbh I didn't know this song 👀", "Makes me think off you", "Somebody saw the actual Dinero at 2:55 ?? Haha", "happy Halloween everyone, be safe🧡", "Idk why peeps are chatting over personality, it was just her part of play in this song which was given and ordered by the team. She is just acting you immatures", "Am I the only English person who listens to this song? There are no English comments 🙁", "Mr bean????", "do you know dokdo?", "LEGENDS ONLY", "For all the haters it's all about the drop fucknuts ", "Is this Spanish or Italian? Gives me more of an Italian vibe but im not sure", "BLINK HERE!!💗  :-\nGuys you people have worked really hard and dont have to be dissapointed.. You were the first ones to reach 600M right??..\nAnd TBH it's not a competition between bts and BP, not according to me atleast, we are doing this so that we can achieve something for our faves\nAnd again you guys don't have to be sad and don't lose hope so soon! \nARMYS fighting!! 💜💗💪", "I recommend you don't use this song to ask someone out.", "VOTE BTS ON MAMA!", "wtf is macklemore doin there?", "congratulations", "Feel special 281 we can go for 290", "*Looks like the haters got the notification....*  :|", "ONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY\r\nONLY KINGS BTS PAVED THE WAY", "Cause we get the fire fire fire\nEllie goulding burn 💗💥💥", "@Rosslynite101 did u not notice all of her other videos are supposed to be sexy and  in this video she is dancing in a bikini tops at all times O_o", "after befikare", "Well, we haven’t see the live performance yet but I can tell why Baekhyun said this is a song full of dance break. \n\nPs.\nMy {shawol, exo-L, nctzen} soul has been blessed", "4M away to achieve 500M YASS", "Why Lia didnt get the highnote that Yeji did?", "muy linda", "Why tf does the beginning sound like Tracey beaker????", "The call language in sud corean in familiar only for me", "Am I the only one who wonders how awkward some of these shots are when recording...", "mi plena", "Who is here after Not Shy MV? Its the end of Itz Series", "How many of u hears to this song everyday???", "Who else skipped that j balvin part? 😪", "up", "Keep on streaming, once!", "is that mikeius from comedy lab??? 0:48", "i think hes running from love.. then finally relize he doesn't wanna run from life and love... or he jus gave up", "I can sense this going trending on tiktok", "me gusta", "I didn't hear she shark sound :(", "Well I just understood one line: 1:11 \"Lemme holla at you for a second\"\n\n😂😂😂", "la toxicaaaa2@", "This generation never will know the boom this was in our day", "Director : how big the bed u want to be ...\nSelena : yeah I can't get enough..", "Which country this belongs to???", "is that my baby Alysha Nett towards the end of the vid? :D", "What Language is this ?", "i totally forgot the lyrics to the chours today, silly me", "Same Mexican beat", "stream", "This is the Gringo's song now. The only 2 words in Spanish they can pronounce properly.", "Que linda", "The comment section is going to be filled up with army soon !!", "ola", "I’m literally doing a worksheet about this song", "Waaaaw trop touchant from morocco ❤❤❤❤❤", "Blinks 🔊🔊🔊just vote blackpink at this  site bcoz we are at 2nd position ..Gfriends are leading us by few votes https://dabemepop.wordpress.com/vote/", "When u use apple's emoji for alot", "bye", "full 2019", "Omg so close", "Sweet californiana", "SORRY MOM I CAN'T BE SILENT WHILE I'M LISTENING THIS SONG", "Am I the only English speaking person in this comment section?", "The new world hit baby Hello From ALBANIA", "Stealing songs isn't enough for Flo Rida, he has to steal music videos too", "You have a dream", "3 billion is done first in history", "0:50 all i hear is HA KHO EE MAYA MYIEE", "cercate the call", "so many thicc booties", "STREAM AND VIEW ATLEAST 10 TIMES A DAY", "200 like", "10 years later?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfric@", "The first part of the song exist to guys!", "me gusta", "amor real", "Who else thought that said Jay-Z?", "Incredible music, but wisin spoiled it.", "Is it just me, or does the first 20 seconds of the song sound like the beginning of “Hotel California” by The Eagles!?🤔🎶🧐", "This is song is in Spanish, too. You must watch this: GRUPO EXTRA - TE AMO TANTO", "Save the earth from Coronavirus", "I was expecting more crazy for myself memes and I'm disappointed", "Make DNA as part of your routine, one in the morning, one in the afternoon and one in the evening, it's not stressfull and very aesy to do!", "Who ever canes up after watching Befikre movie please thumbs up 😂😊", "Diamonds!! Marina <3", "393tr views", "Spain is my leg", "Greetings from Belgium ( TomrrowLand is waiting ...Let's dance and drink)", "when music had a soul", "Are you guys brothers", "*next 4 MVs to reach 1 BILLION*\r\n1.FAKE LOVE \r\n\r\n2.MIC DROP\r\n\r\n3.IDOL\r\n\r\n4.DYNAMITE  \r\n\"LIFE GOES ON\" ALSO <333\r\n\r\nlets make it happen ARMYYYY <3 boraahaaeee....fighting >>>\r\n\r\n\"TEAM WORK MAKES A DREAM WORK!\"", "I’m subscribing to every one who subs to me", "Me encanta la cancion#ozuna", "2018 anyone??", "Fuck off about Gangnam Style, its has had its 15 minutes of fame!", "After 7 years I noticed the music got sonar sound .... 🤣🤣🤣", "Pls sub to me", "Like si estás antes del billon ❤️🔥", "omg i need a condo in brazil", "I never here this banana song I already here a pese but I not the banana inside now I here it I love banana to eat", "C'est trop triste😭", "my arms is arround you X", "Ete sech", "BTS should collab with other kpop groups \n\n\n\nEdit: Charli XCX kinda reminds me of the girl who plays as Dora in the new Dora movie", "Where is rich chigga", "Video reacción Coreano Loco!!", "La nueva copia barata de Bad Bunny", "la la la la la la chin.... activia jajajaj", "i", "Anyone here from seeing her on YouTube ads?", "El final una mierdaaaaaaaaaaaa", "J'adore ♥", "4# In The United States of America good luck from United states😃😃", "Megusta tu cansion", "this is giving me zayns tight rope vibes", "They're backk latinassss EEEK", "This is the English comment u were searching for!!", "Aventura papa", "He is popoy", "Leave a like if you love this song", "why the hell are the comments ong 258k like ARMY wrote 1m plus", "1/9th of the worlds population has heard of this song", "daddy yannky", "am i the only one who listens to the instrumentals more than the vocals", "3:27\nCould have been a Fortnite Dance", "Argentina en la casa🇦🇷🇦🇷🔥🔥", "mais beaux", "la cansion de mi vida", "like xd", "make a song with real madrid as the title", "thank u guys for spamming, and give your time too check my Queens MV \n\n—love", "I am the English comment you were looking for!!", "Perro de llano 🎶perro de llano 🎶😂🤣", "Vraiment ça coche back to back non stop rock on", "Eccezionali bella canzone", "RIP lea", "wow i have rebeted this song more times", "More like they speak French solely. (Even is some speak English, the extremists treat the English language like Evil) The provincial prime minister is pro anglophone annihilation. ", "Ozuna solo", "YOU CANT STOP ME LOVIN MAASELF ♥️", "300 million let's go!!!", "amo este video yo y mi novia cojimos a este video", "Guys Like is green Dis I Like is red now your know the different??", "Sir despacito hacked really", "0:53 daft punk spotted !", "faltame al respeto romeo", "on repeat tout l'ete", "Can Molly do a cover of this without him?", "army decora", "Dj snake 🇩🇿🇩🇿🇩🇿🇩🇿🇩🇿", "como amo este tema ❤", "Me: mum, where are we going for holidays? \nMum: London, maybe Greece...\nDad:", "It feels like i came back  in the first time they debuted.", "Love is nothing stronger", "**chokes on ramen noodles**", "I can't get laid in Russia", "Where my Mexicans at 💯💪🏼🇲🇽🇲🇽🇲🇽💯", "Tu chante très bien , si tu chante sencerment pour Dieu , que Dieu te benisse . If you sing sincerely for god , My god  bless you . I'am congolese", "Album por favor hermano!", "Who's here in 2021 :^", "Here's ur English comment that you're looking for", "Holaa latinos😄😄😄", "Do The Sangria Wine🎶❤❤❤❤❤❤", "@06stephi \ngermany isn´t rich ^^", "G loco 😜 😂😂😂😂😂nice", "You are102..eating sugar yes papa", "Taco John's brought me here", "Despacito", "When you're black but she says she only likes Mexicans", "#like", "LIKE POR My TOWERS", "nio garcia😍❤️", "Belle chanson", "El Video un copo atrasado de 2020\nLa Lyrics Mortal Kombat!", "Cardi B from stripper to famous RAPPER. \"GOOD LIFE.\" I LIKE IT LIKE THAT....", "OMG , someone tag @lauramellado 😍🤣", "Has it really been 7 years?", "*Got my Spanish ting convinced that I know Spanish*", "only 1 m need", "Anyone from India🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "this is the English comment you've been searching for..", "#YOU_NEVER_STREAM_ALONE", "El weón horrible", "God Bless Haiti...", "except if you are english\n", "j'adore ca!", "asco :v", "2017: the year of ed sheeran", "Je t'adore marque dupré", "It's 2am here still streaming till it hit 50m", "Banda de naho", "like si JHAY CORTEZ se parece a anuel aa\n.", "Que lindo!!!!!!!!!!!!!!!!", "chidoo video jejeje!!!", "Q tal", "ave fenix!", "it's crazy", "@caram7540 no shuan should have won", "350,301\nviews +\n530 Full \nRaitings", "La cancion filter es mi favorita por que es de mi baby", "Super ! J'adore ! :-)\n", "nul", "I see CL I click.", "Is it a single take video....", "nul", "Ok but why they look like dancin sim characters", "Girls name ?)", "Which language is this ?", "Ete sech 😳👊", "I can't sleep tho it's 12:51am we need to $tr3am,yes yes yes we need to reach 600M 💜 we won't give up easily 💜", "Still waiting for Lisa, jisso and rose solo music video ❤️❤️", "go broncos and please if you are a Broncos fans buy this on itunes..\ni dont play football but i touch down everywhere...", "Why do I just focus on Lisa?! She caught all my attention."]}